[
    {
        "address": "6 Thorn Lane Main, Toronto",
        "property_type": "Detached Bungalow",
        "price": "$3,000",
        "description": "This 1,012 s.f.executive Bungalow Situated in a prime Don Mills location with a perfect score of \"10+\". Featuring An Open Concept Living / Dining, Large Kitchen. Proximity to various amenities and services. Schools of all levels, both public and private, so convenient for families with children, easy commuting with the T T C, and access to the 401 and D V P almost on your doorstep. The best shopping centers are within walking distance; Restaurants, V I P Cineplex, Metro, Shoppers, specialty shops + boutique shopping couldn't be easier.",
        "bedrooms_number": "3",
        "washrooms_number": "1",
        "square_feet": "1012",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jun 2, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "32 Overton Cres, Toronto",
        "property_type": "Detached Bungalow",
        "price": "$4,100",
        "description": "BEAUTIFUL RENOVATED DETACHED BUNGALOW, 3 BDRMS + 1, 2 FULL WASHROOMS INCLUDING ON OPEN CONCEPT GRANITE COUNTER KITCHEN WITH S/S APPLIANCES, HARDWOOD FLOORS, W/O TO A LARGE FENCED BEAUTIFUL BACKYARD WITH MATURE TREES FOR SUMMER BBQS, LARGE DRIVEWAY (4 TO 5 CARS). IN A VERY DESIRABLE LOCATION, PARKS, SCHOOLS, TTC, SHOPPING MALL JUST STEPS AWAY, MINUTES TO DVP AND 401/404 HWYS.",
        "bedrooms_number": "3",
        "washrooms_number": "2",
        "square_feet": "1277",
        "ac_type": "Central Air",
        "laundry_type": "In Basement",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jun 1, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "96 Berkinshaw Cres, Toronto",
        "property_type": "Detached Bungalow",
        "price": "$4,300",
        "description": "Bright & Spacious 3+3 Beds Family Home In Prestigious Don Mills Neighbourhood. Steps To Norman Ingram School, Don Mills CI, Library, Shops At Don Mills, LA Fitness, Parks And Many Other Amenities. Close To TTC, 401/404 & DVP. Beautiful Main Floor 3 Bedrooms With Living Room, Kitchen, And One Bathroom. Hardwood Floors. Renovated Separate Entrance Basement 3 Bedrooms With 2 Bathrooms And Full Kitchen. No Sidewalks. Driveway Parking For up to 4 Cars. Don't Miss It. Move In And Enjoy!",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1086",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jul 2, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "5 Caravan Dr, Toronto",
        "property_type": "Detached Backsplit 5",
        "price": "$4,400",
        "description": "Location, Location, Location. In The Heat Of Banbury - Denlow Public School District With Gifted Program. Spacious 3 Bedrooms. Updated Kitchen With Lots Of Skylights. Living Room & Family Rooms With Fireplace.",
        "bedrooms_number": "3",
        "washrooms_number": "2",
        "square_feet": "2734",
        "ac_type": "Central Air",
        "laundry_type": "Common Area",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jun 17, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "209 The Don Way E, Toronto",
        "property_type": "Att/Row/Twnhouse 3-Storey",
        "price": "$4,500",
        "description": "Spacious and Stylish Townhome Available for Lease in BanburyDon Mills!This well-maintained, 4-year-old modern townhome offers 4 bedrooms, 4 bathrooms, and over 300sq. ft. of private outdoor space, including two balconies and a large rooftop terrace perfect for enjoying some quiet time or entertaining guests.Inside, you'll find an open and airy layout with high 9-foot ceilings on the main and second floors. The kitchen is designed for both everyday use and hosting, with a generous center island and plenty of room to gather.The home includes an oversized 2-car garage and has been upgraded with thoughtful details like hardwood flooring, quartz countertops, pot lights, custom window coverings, oak stairs with iron pickets, and modern light fixtures. Smart thermostat installed. Freshly painted throughout. The basement has a rough-in for a 3-piece bathroom if additional space is ever needed. Located in a family-friendly area with easy access to top-rated schools, nearby parks, shopping(including Don Mills and Fairview Mall), transit (subway, GO station, and future Eglinton LRT),and major highways (DVP, 401, 404).A great option for those looking to lease in a convenient and upscale North York neighbourhood.",
        "bedrooms_number": "4",
        "washrooms_number": "4",
        "square_feet": "2300",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jul 1, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "18 Greengate Rd, Toronto",
        "property_type": "Detached Bungalow",
        "price": "$4,950",
        "description": "Prime Location On Quiet Street. With 5+2 Large And Spacious Br 3,244 St Ft, Featuring Newly Upgraded Floors And Freshly Painted Walls. Steps To Edwards Gardens & Banbury Community Centre. Walking Distance To Rippleton P.S. & St. Bonaventure Cath School. Close To Great Pub & Private Schools (Toronto French, Crescent, Bayview Glen, Denlow P.S., Willowwood School, Glendon Campus (York Univ), Shops At Don Mills, Granite Club, Parks, Trails & Ttc. Mins To Downtown. Ez Access To Hwys.",
        "bedrooms_number": "5",
        "washrooms_number": "3",
        "square_feet": "3244",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jul 1, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "2 Sonata Cres, Toronto",
        "property_type": "Detached 2-Storey",
        "price": "$5,500",
        "description": "Spacious 4+2 Br House, Private Yard With Very High Hedges, Located On Quiet Family Street Of Denlow School District! Premium Size 78 X 110' Lot, On A Much Sought-After Quiet Crescent West Of Banbury Rd. Walk To The Best Public And Private Schools In The City: Denlow Ps, Winfields Ms, York Mills Ci And St. Bonavenure Catholic Schl, Parks, Ttc, Banbury Community Centre And Shops. Near Longo's Plaza, Shops At Don Mills, Fine Restaurants And Edwards Gardens.",
        "bedrooms_number": "4",
        "washrooms_number": "4",
        "square_feet": "3071",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Baseboard",
        "sale_or_rent": "for lease",
        "date_available": "Jun 23, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "16 Brian Cliff Dr, Toronto",
        "property_type": "Detached 2-Storey",
        "price": "$9,000",
        "description": "Rarely Offered Exquisite Private Home in the Heart of Toronto! Large Premium Ravine Lot With 100 Ft Frontage and Over 1.5 Acres total! Over 5,800 sqft of Interior Living Space plus 2,300 sqft in Basement! This Beautifully Uniquely Designed Home W/Distinction & Elegance! Bordering On Ravine Setting Offers Peaceful Living & Ideally Designed For Entertaining. Just Minutes Away From Edward Gardens, Top Public and Private Schools, TTC Bus Station, Malls, Shopping And Highway.",
        "bedrooms_number": "7",
        "washrooms_number": "8",
        "square_feet": "5830",
        "ac_type": "Central Air",
        "laundry_type": "Laundry Room",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease",
        "date_available": "Jul 2, 2025",
        "parking_type": "garage parking"
    }
]