[
    {
        "address": "120 Dallimore Circ 926, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$485,000",
        "description": "Welcome to your serene retreat in the sky at 120 Dallimore Circle #926, a newly renovated penthouse-level 1-bedroom, 1-bath condo nestled in one of Torontos most desirable midtown pockets. Enjoy rare, unobstructed panoramic views of lush green space and the Toronto skyline the perfect backdrop for morning coffee or sunset unwinding. Set in a quiet, upscale community, this suite offers an ideal balance between city convenience and natural beauty. You're just minutes from the Shops at Don Mills for upscale dining, shopping, and entertainment, and steps from scenic trails, parks, the Don Valley ravine system, and the new LRT. Inside, youll find a modern open-concept layout featuring engineered hardwood floors and 17 pot lights throughout, a sleek kitchen, a brand-new washer, and floor-to-ceiling windows that fill the space with natural light. The large balcony extends your living space into the open air. Premium building amenities include 24-hour concierge and security, a fully equipped fitness centre, indoor pool and hot tub, party and media rooms, guest suites, and ample visitor parking. With quick access to the DVP, Highway 401, and TTC, commuting is effortless. Whether you're a first-time buyer, professional, or investor, this condo delivers luxury, lifestyle, and location in one elegant package. Discover elevated living in one of Torontos best-kept secrets.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "75 The Don Way W 805, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$499,000",
        "description": "Come Live in Liv Lofts! This beautiful, fully furnished loft-style condo perfectly blends modern style and comfort. Featuring a queen-size Murphy bed, built-in storage, and impressive 10 ft. ceilings with exposed concrete, this space is both spacious and inviting. The home includes a large flat-screen TV and a fully equipped kitchen with quartz countertops and stainless steel appliances, along with a private walk-out balcony.The building offers fantastic amenities, including a gym, a party room/lounge area, a hot tub, and a rooftop deck with panoramic views of the city.",
        "bedrooms_number": "0",
        "washrooms_number": "1",
        "square_feet": "415",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 5, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "120 Dallimore Circ 621, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$499,000",
        "description": "Welcome to The Beautiful and Perfectly Located Red Hot Condos, In The Heart of The Don Mills Banbury Area! This Beautifully Maintained and Open Concept 1 + 1 Condo Offers All You Need for Convenient, Peaceful and Quality Living! This Unit Offers Clear South Views of Downtown/CN Tower, An Abundance of Natural Light and Very Spacious Rooms. The Bedroom Offers A Custom Built Closet and Very Bright Lighting Through an Extra Large Window. The Open Concept Living and Dining Area Offers Ample Space to Customize Your Layout With Fantastic South Views. The Modern Kitchen and Spacious Den Offers Great Functionality. This Building is Very Well Maintained, Just Steps from Parks, Ravine Trails,Restaurants, Grocery Stores, Shops at Don Mills, DVP/Highways, Public Transit and the Eglinton LRT line. This Building Has Amazing Amenities Including a Media Room, Gym, Party Room, Indoor Pool and Sauna. Don't Miss Out On This Great Opportunity to Live in The Heart of This High Demand Neighborhood. Just Move In and Enjoy!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "605",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 1020, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$509,900",
        "description": "Prime Don Mills Community Location! Nice & Cosy One Bedroom plus Study, Sunset S Model 533 sq ft per Builder's Floor Plan + Huge Balcony With Lights, at Rodeo Condominiums. Gorgeous Unobstructed Panoramic South, South East & South West View of the City! Stunning Architecture by Hariri Pontarinini & Award-Winning Alessandro Munge. 9 ft Ceiling, Open Concept Layout. Designer Series Kitchen Cabinetry & Miele Appliances. Custom Made Pax System Closet Organizers In Bdrm. Parking & Locker Included. Don Mills Centre Is in the Heart of Midtown Connected to Great Shopping, Fine Dining, Schools, Parks, Libraries & Community Centres. TTC at Your Doorstep with Fast Connection to Yonge/Bloor Subway Line & Downtown.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "533",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "797 Don Mills Rd 1507, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$514,900",
        "description": "Step into stylish 15th-floor living with stunning north views and 10-foot ceilings that fill the space with natural light. This freshly renovated unit features new flooring, a sleek kitchen with stainless steel appliances and granite counters, and a refreshed washroom. The spacious bedroom offers two closets, while the enclosed den with French doors and large windows is ideal for a home office or as a second bedroom. Prime location at Eglinton and Don Mills, steps to parks, the Science Centre, Shops at Don Mills, and top schools. Easy access to the DVP, transit, and the upcoming Eglinton Crosstown LRT",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "680",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jun 30, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "120 Dallimore Circ 915, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$515,000",
        "description": "Stylish & Chic! Here Is Your Chance To Own This Stunning 1 + 1 Bdrm In The Heart Of The Prominent Banbury-Don Mills Area. This Bright and Spacious Condo Has An Open Concept Layout & Upgraded Kitchen Which Is Perfect For Entertaining. The Modern Kitchen Boasts Sleek Quartz Countertops, Undermount Sink & Stainless Steel Appliances. The Den Can Be Used As An Office Or 2nd Bdrm W/Added Storage & Removable Screen. Relax On The Private Balcony W/South Facing Unobstructed City Views. Tons Of Natural Light! Enjoy Fantastic Building Amenities W/Fully Equipped Fitness Center, Indoor Pool & Hot Tub, Party Room & Lounge, Outdoor BBQ, 24/7 Concierge, Billiards Room, Guest Suites & More. Unbeatable Location! You're just minutes from Shops at Don Mills, Grocery Stores, Parks, Top-Rated Schools And Tranquil Moccasin Ravine Trail. Easy Access To The DVP & Public Transit Makes Commuting A Breeze! Whether You Are First Time Buyers, Young Professionals, Or Investors - This Condo Is For You! Don't Miss Out On This Incredible Opportunity! Book Your Showing Today!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "625",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "99 The Donway West Rd 203, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$519,000",
        "description": "Luxurious Flaire Condos located in the heart of the shops at Don Mills. Restaurants, bars and cafes, grocery stores, banks, LCBO, Shoppers Drug Mart, the Don Mills library, parks, places of worship & more within walking distance. Gorgeous one-bedroom, open concept condo w/ 10' ceilings, beautiful plank floors, chic kitchen, granite countertops, modern backsplash & upscale appliances. Spacious living room w/ large 8' sliding door leading onto a large balcony on the quiet side of the building. Comes with in-suite laundry, one parking space, one storage locker. Great value - very low condo fee, low property tax. Perfect starter home for young professionals, young couples, and first-time buyers. Building includes a gym, impressive roof-top patio with BBQs & lounge space, theatre, party room, pet spa, concierge & security, and plenty of visitor parking. Convenient transit, bus stop right in front of building. Quick drive to major highways DVP/404, 401, and downtown.***vacant property, freshly painted, just move in*****",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "520",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1103 Leslie St 202, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$529,000",
        "description": "Charming, Elegant & Move-In Ready! Welcome To True Pride Of Ownership In This Beautifully Renovated One-Bedroom Condo. Tucked Away In A Highly Desirable Building At 1103 Leslie St. Bathed In Natural Light From Large Windows, This Bright And Airy Unit Features Modern Flooring And An Open-Concept Layout Perfect For Both Daily Living And Stylish Entertaining. The Upgraded Kitchen Boasts Brand-New Stainless Steel Appliances, Custom Cabinetry, A Movable Island, Mirrored Backsplash, Granite Countertops, And An Oversized Custom Sink For Added Function And Flair. The Spacious Primary Bedroom Includes A Walk-In Closet With Built-In Organizers And Direct Access To A Luxurious 4-Piece Ensuite Bathroom. Enjoy Heated Floors, A Custom Rain Shower, Elegant Tilework, And Built-In Niches For Your Personal Care Essentials. Step Out Onto Your Private Balcony, Surrounded By Mature, Flowering Trees - A Peaceful Escape. This Exceptionally Well-Managed Building Offers Recently Renovated Amenities Including A Large Party Room, Games Room, Gym, Hobby Room, And A Guest Suite. Outdoors, Enjoy One Of The Areas Most Celebrated Private Gardens, Exclusive To Residents. Close To Shopping, Entertainment, Scenic Trails, Ravines, Parks, TTC, LRT, And More. There's Truly No Other Unit Like This In The Building. Don't Miss Your Opportunity To Own This Stunning, Move-In Ready Home!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "644",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Fan Coil",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 432, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$529,000",
        "description": "RODEO CONDOMINIUMS @ Shops at Don Mills: Maple Floor plan, 495sf - One Bed w/ spacious Balcony. North View. Stunning architecture by the renowned firm of Hariri Pontarini and stylish interiors by award-winning Alessandro Munge set Rodeo Drive apart as an inspiring landmark in the Don Mills community. Set on a majestic podium, Rodeo Condos rises 32 and 16 floors and is marked by a striking black- and-white colour palette evocative of classic modernism. The towers offer panoramic views of downtown Toronto, Don Mills and the Bridle Path neighbourhood, with park-like vistas in every direction. Perforated metal screens, pre-cast panels and fritted white glass on the building facade speak to a contemporary design vocabulary. Connected to great shopping, fine dining, schools, parks, libraries and community centres. TTC and Future LRT is at your doorsteps. Minutes to Hwy DVP/401. ONE PARKING SPOT INCLUDED. **EXTRAS** Integrated counter depth refrigerator, S/S slide in range with glass top, Builtin oven, Panelled multi cycle Dishwasher, S/S Microwave, Built-in hood fan vented to the exterior. Ceiling mounted lighting fixture. Stacked white washer/Dryer",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "495",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 532, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$529,000",
        "description": "RODEO CONDOMINIUMS @ Shops at Don Mills: Maple Floor plan, 495sf - One Bed w/ spacious Balcony. North View. Stunning architecture by the renowned firm of Hariri Pontarini and stylish interiors by award-winning Alessandro Munge set Rodeo Drive apart as an inspiring landmark in the Don Mills community. Set on a majestic podium, Rodeo Condos rises 32 and 16 floors and is marked by a striking black- and-white colour palette evocative of classic modernism. The towers offer panoramic views of downtown Toronto, Don Mills and the Bridle Path neighbourhood, with park-like vistas in every direction. Perforated metal screens, pre-cast panels and fritted white glass on the building facade speak to a contemporary design vocabulary. Connected to great shopping, fine dining, schools, parks, libraries and community centres. TTC and Future LRT is at your doorsteps. Minutes to Hwy DVP/401. ONE PARKING SPOT INCLUDED. **EXTRAS** Integrated counter depth refrigerator, S/S slide in range with glass top, Builtin oven, Panelled multi cycle Dishwasher, S/S Microwave, Built-in hood fan vented to the exterior. Ceiling mounted lighting fixture. Stacked white washer/Dryer",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "495",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Mar 31, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "99 The Donway Way 602, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$539,900",
        "description": "Location Location Location! Luxurious Condo Located In The Heart Of The Shops At Don Mills. OpenConcept Layout. Comes Complete With Upscale Appliances, Beautiful Floors, Large Balcony WithPlenty Of Sun Exposure. Public Transit, Schools, Parks, And More! Plus, Owned Parking Spot AndLocker Included!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "550",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Mar 31, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "50 O'neill Rd 1305, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$559,900",
        "description": "Beautiful, Bright, Brand New Luxurious 1 Bed, 1 Bath W Lovely Private Balcony, Overlooking Spectacular Greenery, The Lively Shops At Don Mills... Unobstructed Views For Miles!! Features Upscale Miele Appliances, Gorgeous Backsplash, Tons Of Upgrades, Centrally Located Steps To Shops, Restaurants, Theatres, Grocery Stores, Transit, Highway 401/DVP, Walking Trails, +++",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "513",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "75 The Donway Way 503, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$579,900",
        "description": "Live the life at Liv Lofts, in highly sough-after Shops at Don Mills! This corner, sun-drenched, 710 sqft 1-bed den, 2 bathroom unit features 10' exposed concrete ceilings, stainless steel appliances, quartz counters, custom kitchen island, floor-to-ceiling windows and a 4-peice ensuite bathroom. Steps to the Shops and all of the dining, shopping, entertainment, parks and leisure options this exciting area offers. Fantastic amenities include gym, party room/lounge area, hot tub, and rooftop deck with panoramic views of the city. Parking and locker included.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "710",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 1, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "120 Dallimore Circ 607, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$589,000",
        "description": "Quietly nestled within the Don Ravine, easy access to Moccasin park & the Don trails. Bike rack & Private Locker included.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "970",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "120 Dallimore Circ 628, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$590,000",
        "description": "Rarely offered and highly desirable North-facing unit at 120 Dallimore Circle is more than just a home. It's a place where cherished memories are made. Nestled in a family-friendly neighborhood, impeccably maintained with modern finishes, this home is well suited for families, professionals, and retirees alike. Throughout, granite counters, backsplash, and breakfast bar. Living room with a walkout to a private balcony and one underground parking space. Enjoy the convenience with transit access right at the doorstep, easy DVP access, and steps to Shops at Don Mills. The property features desirable amenities such as an indoor pool, sauna, gym, billiards room, and more. This home combines convenience and comfort. Don't miss out on the opportunity to turn this house into your forever home - schedule a viewing today to experience the welcoming ambiance of 120 Dallimore Circle.",
        "bedrooms_number": "2",
        "washrooms_number": "1",
        "square_feet": "649",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "May 31, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "99 The Donway W 206, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$590,000",
        "description": "Luxury Condo In The High-Demand Shops At Don Mills! This Stunning 1+1 Bedroom, 2 Washroom Unit Offers 663 Sq. Ft. Of Thoughtfully Designed Living Space. The Spacious Den Features A Sliding Door, Making It A Perfect Second Bedroom Or Home Office. Enjoy A Beautiful West-Facing View With Abundant Natural Light. The Open-Concept Modern Kitchen Features Sleek Finishes, While Laminated Flooring Runs Throughout. The Primary Bedroom Boasts Large Window, Ample Closet Space, And Private Ensuite Bathroom. Exceptional Building Amenities Include 24/7 Security, A Rooftop Terrace With BBQs, Party Room, Fully Equipped Gym, And Theatre Room. Ample Underground Visitor Parking Is Available For Guests. Steps From The Renowned Shops At Don Mills, Featuring Restaurants, Bars, Cineplex VIP Theatre, LCBO, And More. Close To Top Schools - Norman Ingram PS & Don Mills CI (CyberARTS & Gifted Program), Libraries, Bond Park, Edward Gardens, And Scenic Trails. Enjoy Easy Access To DVP/401 For Convenient Commuting. One Underground Parking & One Locker Included.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "663",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 302, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$590,000",
        "description": "Elevate Your Lifestyle In This Condo Suite At Auberge On The Park. Conveniently Located Across From Sunnybrook Park. This Luxurious Tridel-Built One Plus Den Condo Unit Has Two Bathrooms, Totaling 747 Sqft. Den Could Be The 2nd Bedroom. Floor To Ceiling Windows Throughout The Suite. Enjoy An Array Of World-Class Amenities, Such As Outdoor Pool, BBQ Area, Dining Room, Terrace, Fitness Studio, Yoga, Spa, Doggy Park, Pet Wash, Theatre And Party Room, All Offering Unparalleled Luxury Living. 6-Minute Walk to The Line 5 LRT Station, 5-Minute Drive To DVP, And 20-Minute Drive To Downtown Toronto. Lots Of Visitor Parking. Rippleton PS, Northern SS and Don Mills CI School Area.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "747",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "May 30, 2025",
        "parking_type": "parking available"
    },
    {
        "address": "50 O'Neill Dr 622, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$598,000",
        "description": "Welcome to your furnished retreat at Rodeo Condominiums, nestled in the lively Shops of Don Mills! This inviting Melrose floor plan offers 539 square feet of beautifully designed space, featuring a warm bedroom and a generous balcony perfect for relaxing with a book or enjoying a sunset glass of wine. With stunning South West views, you'll be treated to sweeping vistas of downtown Toronto alongside peaceful, park-like scenery that soothes the soul. Step inside and feel instantly at home in a space crafted by award-winning designer Alessandro Munge, where stylish interiors blend seamlessly with the visionary architecture of Hariri Pontarini. Rodeo Condominiums is a true gem, rising 32 and 16 floors above a striking podium, its bold black-and-white facade with perforated metal screens, pre-cast panels, and fritted white glass creating a modern yet welcoming landmark in Don Mills. Living here is about embracing a vibrant lifestyle. You're just steps from fantastic shopping, delightful dining, great schools, tranquil parks, libraries, and community hubs. With the TTC at your doorstep, zipping to the Yonge/Bloor subway line or downtown Toronto is effortless. This is more than a condo, its a place where comfort and connection come together, making every day feel like a warm hug. Come discover your new home today!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "539",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jun 2, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 338, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$599,000",
        "description": "Discover the allure of Rodeo Condominiums @ Shops at Don Mills with this South Facing Avalon Floor Plan! Boasting 681 sqft., this 1 Bedroom + spacious Den (with Ensuite Bath!!) unit features a spacious south-facing balcony and integrated Meile appliances. Designed by the acclaimed Hariri Pontarini Architects and featuring interiors by award-winning Alessandro Munge, Rodeo Drive is a true landmark in the vibrant Don Mills community. Residents enjoy panoramic views of downtown Toronto, Don Mills, and the Bridle Path, along with serene park-like vistas. The building has top of the line, modern amenities such as hot tub, sauna, indoor and outdoor pools, gyms, party rooms, BBQ area, terraces w/firepit & more!! Its facade, showcasing perforated metal screens, pre-cast panels, and fritted white glass, embodies contemporary sophistication.Convenience is keysteps to world-class shopping, fine dining, schools, parks, libraries, and community centers. With TTC and the future LRT at your doorstep and quick access to the DVP, Hwy 401 & 404, you're seamlessly connected to the city. One parking spot and locker are included. Live where luxury meets lifestyle! **EXTRAS** Compare this unit @ ~900/sqft VS ~1000+/sqft for other units in building. Laminate & Ceramic Floors,1 Parking Spot & Locker Included, New Modern Rodeo Dr condos indoor & outdoor pools, sauna, exercise rms, party rms, so many modern amenities",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "681",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neil Rd 815, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$599,000",
        "description": "Welcome to Luxurious Living in The Stylish Rodeo 2! This Stunning South West facing 656 sqft unit boasts 9-foot ceilings and an Oversized Balcony with Incredible UNOBSTRUCTED panoramic views of The City & CN Tower! Floor-to-ceiling windows flood the space with natural light, enhancing the elegant design and luxury finishes throughout. TWO BEDROOMS and TWO Full Bathrooms and a Contemporary Kitchen Located In The Heart Of Shops At Don Mills. Award-winning amenity spaces include an elegant lobby, 24-hour concierge; Indoor lounge, party room dining, and kitchen bar lounge. Fitness centre, sauna, and swimming pool with lounging deck, hot tub, outdoor lounge, and barbecues. Enjoy The Amenities Within Walking Distance! Additional features include one locker and one parking spot.Close To Transit, DVP, and Downtown Toronto. Connected to great shopping, fine dining, schools, parks, library, and Don Mills Civitan Arena. TTC and Future LRT are at your doorstep. Minutes to Hwy DVP/401. One parking and one locker included.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "656",
        "ac_type": "Central Air",
        "laundry_type": "Laundry Closet",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jun 22, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "99 The Donway W 506, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$599,900",
        "description": "Welcome to Urban Sophistication in one of Toronto's Most Vibrant and High Demand Communities. The Shops at Don Mills. This meticulously Designed 1+1 Bedroom, 2-Bathroom Condo Offers 660sq. ft. of Contemporary Living Space and 92 sf of Balcony Space that Perfectly Blends Comfort, Functionality, and Style. Step Into a Bright and Airy West-Facing Unit Flooded With Natural Light, Where Every Detail Has Been Thoughtfully Crafted. The Open-Concept Modern Kitchen Features Sleek Cabinetry, Premium Finishes, and an Integrated Layout that Flows Seamlessly into the Living and Dining Area - For Both Everyday Living and Entertaining. A Spacious Den Offers Incredible Flexibility, Easily Converting into a Second Bedroom, Guest Room, or Private Home Office. The Primary Suite is a Serene Retreat, Featuring Floor to Ceiling Windows, Generous Closet Space, and a Private Ensuite Bath for Added Privacy and Convenience. Location is Everything - and This Condo Delivers. Just Steps From the Renowned Shops at Don Mills, Offering a Curated Selection of Boutique Stores, Fine Dining Restaurants, Trendy Cafes, Cineplex VIP Theatre, LCBO, Pet Spas and More. Outdoor Lovers Will Appreciate the Nearby Access to Bond Park, Edward Gardens, and Scenic Nature Trails, Perfect for Walking, Running, and Cycling. Commuters Enjoy Easy Access to DVP/401, Making Downtown and GTA Travel Effortless.Whether You're a Young Professional, Downsizer, or Investor, this Condo is a Rare Opportunity to Own in one of Toronto's Premier Lifestyle Destinations.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "660",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "10 Inn on the park Dr 2006, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$609,000",
        "description": "Welcome to 10 inn on the park drive. A elegant modern iconic Tridel's residence at chateau auberge, showcasing breathtaking, panoramic views of Sunnybrook Park through floor-to-ceiling windows in every room. Every room. This spacious 1 bedroom unit thoughtfully designed with an open concept layout is filled with natural light from 9-ft floor-to-ceiling windows, combining elegance with functionality. Located just a minutes walk from the Eglinton & Leslie LRT station, commuting is effortless while you're surrounded by nature and greenery. The modern kitchen is a chef's dream, complete with high-end Miele appliances, and sleek cabinetry perfect for entertaining or everyday living. The building amenities are truly top-tier, including state-of-the-art fitness studio, a serene indoor pool and spa with sun terrace, stylish entertainment lounge, outdoor B8Qs, guest suite, and 24-hour concierge.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "611",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "parking available"
    },
    {
        "address": "99 The Donway W 706, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$638,000",
        "description": "Bright & Spacious 1-Plus-Den Unit With Brilliant Layout. Panoramic View and 9 ft ceiling. Gourmet Open Concept Kitchen with Modern Cabinets, Undermount Sink, Granite Countertop & Backsplash. High Quality Laminate Floor. Master Bedroom with Floor-to-Ceiling Window, Mirrored Closet and 4-Pc Ensuite Bath. Ensuite Laundry. Excellent Amenities with Friendly 24-Hr Concierge, 5th Floor Rooftop Terrace & BBQ Area, Theatre/Media, Pool Table, Gym, Party Room, Pet Spa & Visitor Parking. Walking distance to The Shops at Don Mills, Cinema, Bars & Restaurants, Public Transit.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "660",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "50 O'Neill Rd 2501, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$649,000",
        "description": "Luxury Living With Spectacular Skyline Views! This Stunning 2-Bedroom, 2-Bathroom Condo On The 25th Floor Offers Unmatched Elegance And Breathtaking, Incredibly Gorgeous South Unobstructed Unequivocally Beautiful View's Of The Downtown Skyline! Floor-To-Ceiling Windows Flood The Space With Natural Light, Accentuating The 9-Foot Ceilings And Sophisticated Open-Concept Design. Step Onto The Expansive Balcony And Take In The Stunning Cityscape, Or Unwind In The Master Bedroom With Its Own Impressive Vistas. Featuring High-End Built-In Appliances And Premium Finishes, This Suite Offers A Seamless Blend Of Style And Functionality. Enjoy The Convenience Of A Private Parking Spot And Locker. Located In The Highly Coveted Shops At Don Mills, Youll Have Direct Access To Upscale Shopping, Fine Dining, And Effortless Transit, With Quick Access To The DVP, 404, 401, Downtown, And Edwards Gardens. Experience Resort-Style Living With Top-Tier Amenities, Including A State-Of-The-Art Fitness Center, Sauna, Indoor & Outdoor Pools, A Luxurious Party Room, A Landscaped Terrace With A BBQ Area, And 24-Hour Concierge & Security. Surrounded By Beautiful Green Spaces, This Is A Rare Opportunity To Own A True Urban OasisDont Miss Your Chance To Call It Home!",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "656",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 712, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$649,900",
        "description": "This Beautiful One Bedroom + Den Condo Unit Has Two Bedrooms and Underground Parking. Den can be used as Second Bedroom. This Condo Suite Located Across From Sunnybrook Park. Large panoramic Windows Throughout the Suite. Enjoy Of Many Amenities: Outdoor Pool, BBQ Area, Dining Room, Terrace, Fitness Studio, Yoga, Spa, Doggy Park, Pet Wash, Theatre and Party Room. Visitors parking is available. 5 Minute walk to the Line 5 LRT Station, 5 Minute Drive to SVP, And 25 Minute Drive to Downtown Toronto. Rippleton PS, Northern SS and Don Mills CI School Area. Book your showing to see it!!",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "699",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 1907, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$650,000",
        "description": "Welcome To 30 Inn On The Park Drive, Unit 1907 A Beautifully Maintained Condo Apartment Located In The Desirable Banbury-Don Mills Community. This East-Facing Suite Offers Approximately 650 Sq. Ft. Of Living Space With A Bright And Open Layout Featuring Laminate Flooring Throughout, Smooth Ceilings, And A Juliette Balcony With A Walk-Out From The Living Room. The Upgraded Kitchen Boasts Quartz Countertops And A Modern Design. This One-Bedroom Plus Den Unit Comes With One Owned Underground Parking Spot (Level C, Unit 66). Enjoy The Comfort Of Central Air, In-Suite Laundry, And Low Maintenance Fees That Include Building Insurance, Parking, And Central Air Conditioning. Conveniently Situated Near Leslie Street And Eglinton Avenue, With Easy Access To Transit, Parks, And Shopping.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "650",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 1707, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$658,000",
        "description": "Experience elevated living in this stylish 1-bedroom + den, 1-bathroom suite at Auberge on the Park by Tridel. Spanning 650 sq ft, this thoughtfully designed suite includes 1 parking space . Enjoy unobstructed east-facing views with a spacious private balcony perfect for relaxing or entertaining. Residents of Auberge are treated to a collection of amenities, including an outdoor pool, BBQ area, elegant dining room, and inviting party room all designed for sophisticated urban living.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "650",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jun 30, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 IN ON THE PARK Dr 203, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$668,000",
        "description": "Large 721 sq ft with walk out to private garden plato 2 washroom 2 entries good for retired and first time buyer. Best price in high end area walk to sunny brook park and TTC / Light rail transit at eglinton",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "721",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 Inn On The Park Dr E 1439, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$675,000",
        "description": "Own this brand new never lived in luxurious unit at Inn On The Park - The Auberge boutique condominium by Tridel. Featuring an upgraded 1 bedroom + den with 2 Bathrooms. This luxury suite offers 668 square feet of open living space and 9 foot ceilings. Located on the 14th floor, enjoy your north facing views from a spacious and private balcony. This suite comes fully equipped with energy efficient 5-star modern appliances, contemporary soft close cabinetry, in suite laundry, and floor to ceiling windows with window coverings included. Parking and locker are not included in this suite. Amenities: include security, park, gym, spa, pool, party rooms, pet washing facility, theatre room and many more. Parking and Locker are not included.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "668",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "parking available"
    },
    {
        "address": "1105 Leslie St 1106, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$688,000",
        "description": "WOW! Renovated, Bright & Sun-Filled 2-Bedroom Corner Unit With Stunning Unobstructed Views!! This Immaculate Corner Suite Built By Monarch Features 9 Ft Ceilings And Breathtaking Panoramic Views Overlooking A Beautiful Park! Recently Renovated With Brand New Countertops (2025), New Floors(2025), And Stylish New Stainless Steel Appliances(2025), New Vanity (2025) New Faucet (2025). Bright And Airy Open Concept Layout With Floor-To-Ceiling Windows And A Smart Split 2-Bedroom Floor Plan For Added Privacy. Modern Kitchen With NEW stone Counters And Breakfast Bar Overlooking The Spacious Living And Dining Area.Walk Out To The Balcony To Enjoy Spectacular, Clear Views. Located Just Steps From Sunnybrook Park, With Easy Access To TTC, DVP, And Shops At Don Mills.With The Future Eglinton LRT Just Moments Away, This Location Offers Incredible Convenience And HUGE Growth Potential. 1 Locker and 1 Parking Included ! **** A Rarely Offered Renovated Corner Gem With One Of The Best Views In The Building! ****. Highly anticipated Eglinton LRT coming very soon!!!",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "845",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "120 Dallimore Circ 407, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$699,000",
        "description": "Looking for the convenience of a condo with the space of a house? At almost 1000 sq feet, we are larger than many houses. Welcome to suite 407 at increasingly in-demand 120 Dallimore Circle. Once a hidden gem, this building and location are now getting the notoriety they deserve. Suite 407 takes it further with a full lavish renovation including 2 bathrooms, custom kitchen and new modern energy-efficient appliances, blond oak flooring, new contemporary ceiling fans and paint; all of which make this large, split 2 bedroom plus full den, 2-bathroom home, an absolute showstopper. Cozy sun-drenched corner unit overlooking the East Don Trail with a superb split-bedroom layout offering flexibility that suits many a lifestyle. Conveniently tucked in between the the Shops at Don Mills and the (fingers crossed) soon-to-be-open Eglinton LRT; the building has also undergone many recent renovations including the gym, party room and corridors. With the space of a house and convenience of a condo, this is an opportunity rarely afforded, and offers a lifestyle seldom achieved.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "970",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1200 Don Mills Rd 308, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$699,000",
        "description": "Welcome to Windfield Terrace A True Community! Don't miss this opportunity to make it your home. This freshly painted 2-bedroom, 2-bathroom condo offers a bright and spacious living area with charming white shutters on the windows and a large balcony perfect for relaxing. Enjoy a galley style kitchen with a breakfast nook and space for a table. Conveniently located just steps from the Shops at Don Mills featuring eclectic restaurants and a movie theatre and with quick access to the 404, 401, and public transit. All-inclusive maintenance fees cover Bell Fibe TV & High Speed Internet, one parking spot in the underground garage, one locker, and plenty of visitor parking. Exceptional building amenities include a car wash, gym, sauna, squash courts, outdoor pool oasis, and vibrant resident activities. The building boasts a healthy reserve fund and strong community atmosphere. Ready for your personal touch! Note: Condo rules prohibit smoking, pets, and short-term rentals.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "1171",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 15, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "205 The Donway W 521, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$699,995",
        "description": "Welcome to The Hemingway, a quiet, well-managed mid-rise condo in the heart of Don Mills. This 2-bedroom, 2-bathroom suite has been lovingly maintained by its long-time owner and is freshly painted and move-in ready. The layout features a bright open-concept living and dining area, a functional kitchen with ample storage and a breakfast bar, and a private balcony with green views. Residents enjoy a full range of amenities, including an indoor pool, gym, party room, and a rooftop terrace with BBQs, a mini putt area, and scenic city views all within a peaceful, community-focused building. Just steps to the Shops at Don Mills, groceries, Edwards Gardens and local walking trails, TTC, and the DVP. Nearby schools include Norman Ingram Public School, Don Mills Middle School, and Don Mills Collegiate Institute. Includes 1 parking space and locker. A solid, well-run building with a strong reserve fund - perfect for families, retirees, or anyone looking for a quiet, convenient lifestyle in an established neighbourhood.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "860",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1200 Don Mills Rd 507, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$705,000",
        "description": "Offering close to 1,200 square feet, this thoughtfully laid-out condo provides a comfortable and functional space that suits a range of lifestyles. Whether you're downsizing or looking for more room, the open layout and generous proportions make daily living easy. Well-maintained building offers a great selection of amenities, including a fitness room, hot tub, sauna, squash courts, games room and outdoor pool. Quiet, established community with a focus on convenience and comfort. Located just minutes from the Shops at Don Mills, you'll have access to a variety of restaurants, cafes, and everyday essentials. Nearby green spaces like Edwards Gardens and the Don Valley trails offer a welcome escape into nature. Easy commuting with close access to DVP, 401 and TTC routes. A great opportunity in a sought-after neighborhood, your future home offers the right mix of space, amenities, and location!",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "1171",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 In on the Park Dr 1730, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$737,000",
        "description": "Stylish Condo at Auberge on the ParkLive in style at Auberge on the Park, ideally located at Leslie & Eglinton. This bright 1-bedroom + den, 2-bath condo features an open layout with large windows, a private balcony, and in-suite laundry.The modern kitchen includes quartz counters, stainless steel appliances, and under-cabinet lighting. The primary bedroom offers a 4-piece ensuite and closet, while the foyer adds a mirrored double closet for extra storage.Includes 1 parking spot, 1 locker, and easy access to the DVP, 401, Gardiner, and the Crosstown LRT.Urban living meets comfort and convenience.",
        "bedrooms_number": "1",
        "washrooms_number": "2",
        "square_feet": "657",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "50 O'Neill Rd 3010, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$748,000",
        "description": "Living at Rodeo Drive, Shops At Don Mills best kept secret! Don Mills is in the heart of midtown, connected to great shopping, fine dining, schools, parks, libraries and community centres! Stunning 1 Bedroom + Den boasting unobstructed South & South West Views of the city core & beyond from your huge full-size balcony terrace! One of the most functional floor plans with no wasted space featuring enclosed den that makes for the perfect 2nd bedroom or home office. Enjoy open-concept living area with 9ft ceiling & wide vinyl floors T/O. Chef's Kitchen boasting integrated Miele appliances, quartz counters with under-mount lighting. Spacious primary bedroom with Walk-in closet featuring huge floor to ceiling windows with incredible views! Comes with 1 underground parking spot, just steps to Shops at Don Mills & minutes to DVP, HWY 401, TTC public transit, just five minutes to the south, you have the upcoming Crosstown LRT on Eglinton, a speedy gateway to east and west Toronto. it offers an array of amenities including a24-hour concierge, security cameras, a pet spa, fitness room, dry sauna, indoor lounge/party area, outdoor pool, hot tub, and expansive deck with scenic views, outdoor lounge and BBQ areas, a dining room with kitchen, bar lounge,boardroom, and game room!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "650",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1210 Don Mills Rd 202, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$749,000",
        "description": "Amazing Opportunity To Get Into An Spacious Don Mills Condo! Offering Close To 1,200 Sqft. This Thoughtfully Laid-Out Unit Provides A Comfortable And Functional Space That Suits A Range Of Lifestyles. Shining With Natural Lights This Beautiful Space Features 2 Large Bedrooms, 2 Full Updated Bathrooms, A Dedicated Dining Space, New Flooring, Fresh Paint And So Much More! The Fully Upgraded Kitchen Offers An Abundance Of Storage, Integrated Stainless-Steel Appliances, And A Bright Breakfast Area. This Well-Maintained Condo Building Offers A Great Selection Of Amenities Include: Concierge, Outdoor Pool, Visitor Parking, Exercise Room, And More. Very Quiet, Established Community With A Focus On Convenience And Comfort. Located Just Minutes From The Shops At Don Mills, You'll Have Access to a variety of Restaurants, Cafes, and Everyday Essentials. Nearby Green spaces like Edwards Gardens and the Don Valley Trails Offer a Welcome Escape into Nature. Easy Commuting with Close access to DVP, 401 and TTC routes.1 Parking space and 1 Locker Included. All Utilities + Internet Included.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "1140",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jun 15, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 527, Toronto",
        "property_type": "Condo Apt 1 Storey/Apt",
        "price": "$798,000",
        "description": "Welcome to This Modern 2+1 Bedroom 2-Bathroom Condo Unit Where Contemporary Design Meets Urban Convenience In The Heart Of Shops At Don Mills, One Of Toronto's Most Sought-After Communities. Bright, East Facing Unit With Large Windows, An Open-Concept Living & Dining Area And Modern Kitchen With A Granite Countertop And Built-In Appliances.The Primary Bedroom Is A True Retreat With A Walk-In Closet And 4Pcs Modern Bathroom Designed For Comfort And Style.The 2nd Bedroom Is Generously Sized And The Den Is Perfect For 3rd Bedroom A Home Office Or Study. Step Out Onto Your Huge (43' x 5') Private Balcony And Enjoy Stunning View. Luxury Amenities Include:State-Of-The-Art Fitness Centre , Outdoor Terrace With BBQ Stations For Summer Gatherings, Indoor & Outdoor Pools, Elegant Party Room & Social Lounge For Entertaining, 24-Hour Concierge & Security For Peace Of Mind.This Unbeatable Location Is In The Heart Of Shops At Don Mills A Premier Shopping & Dining Destination Featuring; Eataly, Joeys, Taylor Landing, Anejo, Scaddabush,The GoodSon, Starbucks, Cineplex VIP, Metro And More. Its Easy Access To The DVP, 401 & TTC-Be Downtown In Minutes. Surrounded By Lush Parks & Trails, Edwards Gardens & Sunnybrook Park Just Around The Corner.Top-Rated Schools, Hospitals & Community Centres Nearby. This Is The Ultimate Urban Lifestyle At Its Best, Convenient, And Packed With Amenities! Don't Miss Out.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "873",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 626, Toronto",
        "property_type": "Condo Apt 1 Storey/Apt",
        "price": "$829,000",
        "description": "Upgraded Suite With 2 Parking Spots & Ready To Move In!Welcome To 626-20 O'Neill Road Where Contemporary Design Meets Urban Convenience In The Heart Of Shops At Don Mills!This Modern 2+1 Bedroom 2-Bathroom Condo Is A Rare Opportunity To Own In One Of Toronto's Most Sought-After Communities.Step Inside And Be Greeted By Extended-Height Windows That Flood The Space With Natural Light, An Open-Concept Living & Dining Area,Sleek Contemporary Finishes Throughout.The Gourmet Kitchen Boasts A Granite Countertop,Built-In Miele Appliances And Stylish Backsplash Perfect For Home Chefs And Entertainers Alike.The Primary Bedroom Is A True Retreat With A Walk-In Closet And An Unobstructed Panoramic View Of The City.The 4Piece Ensuite Features A Sleek Vanity,Tub/Shower And Modern Fixtures,All Designed For Comfort And Style.The 2nd Bedroom Is Generously Sized Ideal For Family Or Guests.Need More Space?The Den Is Perfect For 3rd Bedroom A Home Office,Study Or Even A Cozy Reading Nook!Step Out Onto Your Spacious-Sized Private Balcony And Enjoy Stunning City Views While Sipping Your Morning Coffee Or Unwinding After A Long Day.Luxury Amenities At Your Fingertips Include:State-Of-The-Art Fitness Centre To Keep You Active,Outdoor Terrace With BBQ Stations For Summer Gatherings,Indoor & Outdoor Pools,Elegant Party Room & Social Lounge For Entertaining,24-Hour Concierge & Security For Peace Of Mind.This Unbeatable Location Is In The Heart Of Shops At Don Mills A Premier Shopping & Dining Destination Featuring;Eataly,Joeys,Taylor Landing,Anejo,Scaddabush,The GoodSon,Starbucks,Cineplex VIP,Metro And More.Need To Drive?Its Easy Access To The DVP,401 & TTC-Be Downtown In Minutes.Surrounded By Lush Parks & Trails,Edwards Gardens & Sunnybrook Park Just Around The Corner.Top-Rated Schools,Hospitals & Community Centres Nearby. This Is The Ultimate Urban Lifestyle At Its Best,Convenient,And Packed With Amenities!Don't Miss Out.Truly Coveted Corner Suite With No Neighbours Above Or Beside You.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "873",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "50 O'Neill Rd 1511, Toronto",
        "property_type": "Condo Apt 1 Storey/Apt",
        "price": "$829,990",
        "description": "Stunning South West Corner Suite in the Heart of Shops at Don Mills! Welcome to this brand-new, beautifully designed 2+1 Bedroom, 2-bathroomParking & Locker southwest corner residence, ideally situated in one of Toronto's most desirable lifestyle destinations Shops at Don Mills. Step into a sun-soaked open-concept layout highlighted by extended-height windows, modern finishes, and an abundance of natural light. The versatile den with a window can easily serve as a third bedroom or a stylish home office. Miele Appliances! The chef-inspired kitchen features granite countertops, built-in stainless steel appliances, and a sleek tile backsplash perfect for both everyday cooking and hosting guests. Pet Friendly Building !Retreat to the primary suite, a luxurious 4-piece ensuite. Luxury amenities include: A state-of-the-art fitness centre, Indoor & outdoor swimming pools, Sauna, hot tub, Elegant party room & social lounge, Outdoor terrace with BBQ stations, 24-hour concierge and security, and much more! Live where everything is at your doorstep. From upscale dining at Eataly, Taylors Landing, Anejo, Joey, Scaddabush, and Starbucks, to boutique shopping, Metro, and Cineplex VIP, the Shops at Don Mills offers the ultimate in urban convenience! Commuters will love the easy access to the DVP, Hwy 401, and TTC, making downtown Toronto just minutes away. Nature lovers will appreciate nearby Bond Park, Edwards Gardens, and Sunnybrook Park, perfect for weekend strolls or outdoor activities. Surrounded by top-rated public and private schools, leading hospitals, and vibrant community centres, this location offers the perfect balance of luxury, lifestyle, and convenience. This is more than a home its a lifestyle!! Don't miss this rare opportunity to own a premium corner unit in an unbeatable location!",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "936",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd 326, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$849,000",
        "description": "Welcome To This Beautiful And Well Appointed Suite.One Of The Most Practical Floor Plans In The Building With Over 1100 Sqft In Size 873 Sqf Inside And Over 250 Sqf Outside.Large Principal Rooms With Den As A Third Bedroom.W/O To A Large Balcony,East Facing Suite Overlooking Shops At Don Mills,Open Concept Floor Plan With Floor To Ceiling Windows Plenty Of Natural Sunlight. Granite Kitchen Countertop, Ceramic Backsplash,Panelled B/I Fridge, S/S Slide In Range With Glass Top, Panelled Multi Cycle Dishwasher, S/S B/I Microwave, Laundry With Stacked Washer/Dryer, Mirrored Closet Doors,1 Parking,1 Locker. The TTC Is At Your Doorstep With Line 25 Running 24hrs A Day. Just Five Minutes To The South There Is Upcoming Crosstown LRT On Eglinton Ave.24 Hr Concierge.Spectacular Amenities Including; Gym, Indoor Pool,Outdoor Pool,Party Room,Barbecue Area,Cabanas,Visitor Parking.Located Steps To Grocery, Restaurants And Retail. Minutes From 401 & DVP.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "873",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "85 The Donway Way W Ph 1201, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$869,000",
        "description": "Gorgeous 10' Penthouse Corner Unit in the Prestigious boutique condo. Located in the heart of the vibrant Shops at Don Mills. Just Fresh painted! This stylish and spacious (1201sft+Balcony) 2 bedroom + den + 2 balcony unit with generously-sized parking and a convenient oversized storage locker offers the perfect blend of comfort, convenience, and modern living. The open-concept and split bedrooms layout is designed for comfort and functionality. Both bedrooms features en-suite four pieces washrooms, spacious closets with additional storage closet in the primary bedroom. The kitchen showcases elegant granite counters, 2 built in ovens, ample cabinet space perfect for entertaining. En-suite bedrooms are well isolated and noise from neighbor is minimized. Residents have access to a variety of amenities, including a concierge, party room, visitor parking, guest suites, gym, indoor parking, and bike storage. A great opportunity to live in a peaceful yet accessible neighborhood, with world-class shopping, dining, and entertainment at Shops at Don Mills. Walk along the Don Mills Trail and The Edwards Gardens Toronto Botanical Garden. Hydro is the only utility that the owner needs to pay, others are all included in the maint fee.",
        "bedrooms_number": "2",
        "washrooms_number": "3",
        "square_feet": "1201",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "10 Inn On The Park Dr 2004, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$885,000",
        "description": "Welcome To Chateau, The Third And Most Luxurious Phase Of Auberge On The Park Master-Planned Community Located At Leslie And Eglinton. This Exquisite 2-Bedroom Corner Suite Offers 949 Sqft Of Living Space Plus 390 sqft Balcony. Enjoy The Northeast-Facing Views of the City From the Floor-to-Ceiling Windows and Private Balcony. Equipped with Energy-Efficient 5-Star Modern Appliances, Soft-Close Cabinetry, and In-Suite Laundry. 1 Parking Included. Access to Hotel-like Amenities, Including a State-of-the-Art Gym, Refreshing Swimming Pool, Rejuvenating Spa, Spacious Party Room, Tranquil Yoga Studio, Invigorating Spin Studio, and Inviting BBQ Area, All Designed to Meet High-End Standards. Surrounded By Four Parks for a Natural Retreat and Conveniently Located Near Highways, Shops at Don Mills, And Supermarkets. Walking Distance To The New Eglinton Crosstown LRT and Sunnybrook Park.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "949",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "May 30, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "70 Broadpath Rd, Toronto",
        "property_type": "Condo Townhouse 2-Storey",
        "price": "$899,000",
        "description": "Spacious, Bright and a warm Townhouse close to all amenities. This charming 2-story condo townhouse in the heart of Don Mills features 3 generously sized bedrooms on second floor with One beautify renovated 4 piece bathroom. The Bright living/dining area leads into a completely renovated kitchen with Granite counter top, stainless steel appliances and a convenient island with seating area. Walk out from the kitchen to your private, expansive backyard that opens to a green space at the back surrounded by mature trees. The finished basement provides the perfect retreat, a space for rec/office or playroom featuring a full bathroom and a cozy gas fireplace for extra comfort. Minutes from DVP, Eglinton LRT and the future Ontario Line. Public transit at your door step and Shops at Don Mills is 10 minutes walking distance away.",
        "bedrooms_number": "3",
        "washrooms_number": "2",
        "square_feet": "1200",
        "ac_type": "Central Air",
        "laundry_type": "In Basement",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 Inn On The Park Dr 1737, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$947,000",
        "description": "Prestigious Auberge On The Park II by Tridel, Offers condominium Luxury in Nature, nestled amongst the verdant Sunnybrook parkland, surrounded by indulgent view of foilage, city and lushly treed pathway in Toronto most exclusive neighbourhood. A corner unit with open plan living, 9ft ceiling with 2 split bedrooms layout and 2 bath, duo balconies offers north, west and south view and view of CN Towers. Premium plank laminate flooring with acoustic underlay, modern kitchen comes with contemporary cabinetry with valence, engineered quartz countertop and matching slab backsplash, top of the line appliances, Motorized black-out blinds and privacy sheer drapes in all rooms. Luxurious Grand lobby lounge, host your event at elegant party room, private dinning room, meeting room and multimedia room. Sky deck offers outdoor pool, whirlpool SPA, outdoor Cabanas+BBQ, outdoor dinning to socialize with friends. Modern fitness centre w/yoga and spin studio, outdoor pet amenity space and wash station. Bicycle storage room. Guest Suites available. Conveniently located, steps from TTC and Eglington LRT(operating soon), surrounded by lush park, walking trails and bike trails, Sunnybrook park, walking distance to shops, grocery, dinning, library, Leaside shopping centre, Shops at Don Mills, easy access to highways, school and many more.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "909",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1101 Leslie St 806, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$949,000",
        "description": "This spacious, quiet, private corner suite is filled with light, and is graced with million-dollar unobstructed views of Sunnybrook Park, Toronto's skyline and glorious sunsets without a single neighbour to peer into your windows. The highly sought-after split-bedroom layout features soaring 9-foot ceilings, two full baths and loads of custom built-ins for personal and home office organization. As a resident of this coveted Carrington Condo, you will enjoy 24-hour concierge service and hotel-style amenities including an indoor pool and sauna. This unbeatable location gets you into or out of the city easily with its convenient access to TTC, future LRT, DVP and 401. The scenic and well-maintained Toronto Park and Trail System for walking and cycling are right across the street and will take you easily to the lake. With *TWO* side-by-side parking spaces and a large locker, you will have all you need for many years of happy, comfortable, convenient and safe condo living.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "1240",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn on the park Dr 2404, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$988,000",
        "description": "Luxury living awaits in this 899 sq ft 2-bed, 2-bath corner unit at Auberge on the Park, featuring a panoramic balcony, open-concept layout with premium upgrades, floor-to-ceiling windows, and high-end finishes, plus access to top-tier amenities like a pool, fitness centre, spa, and concierge service, all in a prime location near parks, transit, shopping, and dining.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "884",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "74 Dutch Myrtle Way, Toronto",
        "property_type": "Condo Townhouse 3-Storey",
        "price": "$998,000",
        "description": "Welcome to 74 Dutch Myrtle Way, a stunning three-storey townhouse nestled in the highly desirable Don Mills and Lawrence neighbourhood, within walking distance to the Shops at Don Mills. This spacious and sun-filled home offers three generously-sized bedrooms and four beautifully updated bathrooms. The renovated eat-in kitchen features quartz countertops, stainless steel appliances, and charming views of the front courtyard. The open-concept living and dining areas are perfect for entertaining, with a walkout to a private deck, and a beautifully landscaped backyard oasis, a rare find in this urban setting. Upstairs, the primary bedroom features two closets and a luxurious 3-piece ensuite. The second bedroom includes a double closet and a 4-piece ensuite. The third-floor bedroom provides added privacy, perfect for a guest room, office, or studio space. The third level offers access to a stunning rooftop patio with scenic views, ideal for a morning coffee or evening cocktails. The lower level includes a cozy family room with an electric fireplace and above-grade windows, a 2-piece bathroom and direct access to the garage. **Pets Allowed** Don't miss this exceptional opportunity to own a turnkey home in one of Toronto's most desirable communities.",
        "bedrooms_number": "3",
        "washrooms_number": "4",
        "square_feet": "1792",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 2303, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,048,000",
        "description": "Welcome To This Exquisite 2-Br, 2-Bath Luxury Condo, Boasting A Stunning Wrap-Around Balcony Perfect For Enjoying Sunset Views From The West And An Open Sky Panorama From The North! This Corner Suite Features 9 ft Smooth Ceilings Throughout, Adding To The Spacious And Airy Feel. The Modern Kitchen Features Quartz Countertops With A Matching Slab Backsplash, Stainless Steel Appliances, And A Panel-Fronted Built-in Dishwasher. The Primary Bedroom Includes A Walk-In Closet & An Ensuite Bath For Your Convenience And Privacy. The Split Bedroom Floor Plan Maximizes Privacy, Making It Idea lFor Young Families Or Guests. Sunlight Floods The Open Floor Plan From The North, East, And West. The Wrap-Around Balcony Extends Your Living Space Outdoors, Offering Fantastic Night Views Overlooking The City And A Kaleidoscope Of Autumn Colors From The Nearby Serena Gundy Park. This Is An Incredible Opportunity To Be The First To Live In This Exclusive Enclave Of Luxury Condominiums. **EXTRAS** Fridge, Stove, Built-In Dishwasher, Washer, Dryer, All Light Fixtures. All In \"As Is\" Condition.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "1056",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1200 Don Mills Rd 101, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,089,000",
        "description": "Rarely offered. First time in the market for 30 years. Proud ownership. Live in the style of a 2 bedroom bungalow with the comfort of the condo. Easiest Access to Front Desk & all the Amenities of the building. Perfect for elderly people. Approximately 1600 Square Feet of 2 Bed & 2 Bath unit in the Sought After Windfield Terrace. Situated In The Prestigious Don Mills & Lawrence Area. One of the best floor plan in the building. Natural Light Floods Every Room. Huge Ensuite Laundry Room With Sink. Tons Of Storage. Two Side By Side Parking Spots Are Steps Away from Elevator. XL Locker Included. Maintenance Fee Covers All Utilities Plus Cable & High Speed Internet. Impeccably Managed Condominium With First-Class Amenities. Ideally Situated Within Walking Distance To The Shops At Don Mills, Restaurants, Banks, Library, Parks, Scenic Trails And More.**EXTRAS** Hotel-like amenities. Full Service Bldg W Landscaped Gardens. Outdoor Pool, Squash Courts, Sauna, Hot Tub, Car Wash, 24Hr Concierge, Gym, Party Room, Activities Desk, Visitor Parking. On-Site Mgmnt & Superintendent.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "1600",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1200 Don Mills Rd 220, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,099,000",
        "description": "Welcome to Suite 220 in the highly coveted Windfield Terrace. Located in the desirable Don Mills and Lawrence neighbourhood. With over 1700 square feet of exquisite living space, this beautiful two bedroom, three bathroom suite offers elegance and breathtaking garden views from every room. This sought after split-bedroom floor plan creates a separate wing ideal for guests and provides additional privacy. The welcoming foyer adorned with marble floors and a closet, leads seamlessly into the spacious eat-In kitchen complete with stainless steel appliances, breakfast area and pantry. The expansive formal living and dining rooms provide a perfect setting for entertaining while taking in views of the picturesque award-winning garden. Solarium extends the living and dining areas offering a peaceful retreat. The impressive primary suite includes a walk-in closet, luxurious 4-piece spa-inspired ensuite with a soaking tub and walk-in shower and a walk-out to the private terrace. The spacious second bedroom includes his and hers double closets, a 4 pc ensuite and serene garden views. Two side-by-side parking spots and one locker are included. The all-inclusive maintenance fee covers all utilities, cable, and internet. This impeccably managed condominium offers first-class amenities, including a 24-hour concierge, gym, sauna, outdoor pool, squash courts, whirlpool, hot tub, party room, and games room. Ideally situated within walking distance to the Shops at Don Mills, top restaurants, banks, the library, parks, scenic trails, and more, this prime location has it all.",
        "bedrooms_number": "2",
        "washrooms_number": "3",
        "square_feet": "1709",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "291 David Dunlap Circ, Toronto",
        "property_type": "Att/Row/Twnhouse 3-Storey",
        "price": "$1,238,900",
        "description": "Don Mills Show stopper! This immaculate freehold townhome offers 3 spacious bedrooms and 3 full bathrooms, finished with rich hardwood flooring, freshly painted bedrooms, sleek pot lights, and elegant California shutters throughout. The airy main floor impresses with soaring ceilings and a stylish open-concept layout, featuring a modern kitchen with a striking waterfall island and French door walkout to the largest sundeck in the complex. Enjoy seamless indoor-outdoor living with a cozy living area that opens directly to a private patio ideal for entertaining or unwinding. The primary suite is a true retreat, showcasing a beautifully updated ensuite and two generous double closets for ultimate comfort and functionality. The fully finished basement adds versatility with a dedicated office or potential 4th bedroom, a full 4-piece bath, and direct garage access. This home is fully move-in ready just pack your bags and start living! Parking for 3 vehicles. All in a prime Don Mills location with quick access to the DVP, Hwy 401, Shops at Don Mills, top-rated schools, parks, TTC, and the Eglinton Crosstown.",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1887",
        "ac_type": "Central Air",
        "laundry_type": "",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "1200 Don Mills Rd 217, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,349,000",
        "description": "RARELY OFFERED, *Approximately 2100 Square Feet* Beautiful And Spacious Two Bedroom, Two Bathroom Corner Suite In Sought After Windfield Terrace. Situated In The Prestigious Don Mills And Lawrence Neighbourhood. Largest Floor Plan In The Building. Corner Suite Provides Additional Privacy. *West Facing Garden Views From Every Room* Impressive Foyer With Marble Floors And Two Double Closets Leads You To The Expansive Living Area That Features A Walk Out To A Private Terrace And Wall To Wall Windows That Showcase Magnificent Views Of The Stunning Garden. Formal Dining Room With French Doors Perfect For Hosting Gatherings And Entertaining. Massive Eat-In Kitchen With Breakfast Area And Floor To Ceiling Built In Cabinetry. Large Primary Room With Two Walk-In Closets And 3-Pc Ensuite. Enjoy Waking Up To Views Of The Garden Every Morning. Natural Light Floods Every Room. Huge Ensuite Laundry Room With Sink and Tons Of Storage Space. Two Parking Spots Side By Side, Steps From The Elevator And Two Lockers Included. The All Inclusive Maintenance Fee Covers All Utilities, Cable And Internet. Impeccably Managed Condominium With First-Class Amenities Including 24 Hr. Concierge, Gym, Sauna, Outdoor Pool, Squash Courts, Whirl Pool, Hot Tub, Party Room and Games Room. Prime Location. Ideally Situated Within Walking Distance To The Shops At Don Mills, Best Restaurants, Banks, Library, Parks, Scenic Trails And More. **EXTRAS** Hotel-like amenities. Fabulous Full Service Bldg W Landscaped Gardens, Resort Like Outdoor Pool, Squash Courts, Sauna, Hot Tub, Car Wash, 24Hr Concierge, Gym, Party Room, Activities Desk, Visitor Parking. On-Site Mgmnt & Superintendent.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "2071",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 222, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,488,000",
        "description": "Introducing the epitome of modern living by renowned builder TRIDEL Auberge on the Park, a true breath of fresh airhe residence is nestled amidst the luxurious estates of Bridle Path and Hoggs Hollow, offering a serene and exclusive living experience. Discover elevated living in this beautifully designed 3-bedroom plus den suite, ideally positioned with west-facing exposure to capture stunning sunsets and lush park views. Flooded with natural light through expansive windows, this unit features a functional, open-concept layout that seamlessly combines comfort and style.The thoughtfully designed den offers flexible space perfect for a home office, reading nook, or guest room. Enjoy the serenity of nature while being just moments away from the city core, with easy access to TTC, DVP, and future LRT. Don't miss this rare opportunity to own a spacious, light-filled home in one of Torontos most prestigious master-planned communities.",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1468",
        "ac_type": "Central Air",
        "laundry_type": "Laundry Room",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "20 O'Neill Rd TH101, Toronto",
        "property_type": "Condo Townhouse 3-Storey",
        "price": "$1,550,000",
        "description": "RODEO CONDOMINIUMS @ Shops at Don Mills: Canon Floor plan, 2426sf - 2 +1Bed w/West View (Park). Stunning architecture by the renowned firm of Hariri Pontarini and stylish interiors by award-winning Alessandro Munge set Rodeo Drive apart as an inspiring landmark in the Don Mills community. Set in the majestic podium of Rodeo Drive Condos 32 and 16 floors and is marked by a striking black- and-white colour palette evocative of classic modernism. The towers offer panoramic views of downtown Toronto, Don Mills and the Bridle Path neighbourhood, with park-like vistas in every direction. Perforated metal screens, pre-cast panels and fritted white glass on the building facade speak to a contemporary design vocabulary. Connected to great shopping, fine dining, schools, parks, libraries and community centres. PARKING AVAILABLE AT $100,000. MF $74. **EXTRAS** S/S Panelled refrigerator, S/S slide in range with glass top, Builtin oven, Panelled multi cycle Dishwasher, S/S Microwave, Built-in hood fan vented to the exterior. Ceiling mounted lighting fixture. Stacked white washer/Dryer.",
        "bedrooms_number": "2",
        "washrooms_number": "4",
        "square_feet": "2426",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Heat Pump",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "parking available"
    },
    {
        "address": "205 The Donway East, Toronto",
        "property_type": "Att/Row/Twnhouse 3-Storey",
        "price": "$1,599,000",
        "description": "*** Modern Luxury Freehold Townhouse in Prestigious Banbury-Don Mills *** Almost Brand New Condition, Hardly Used *** Semi-Like Corner Lot With A Wide Frontage Of 58.5 Ft *** 9 Ft Ceiling And Windows All Around 3 Sides, Offering Tons of Natural Light and a Beautiful City View *** Over 2000 sqft Interior Space With Extensive Upgrades & Thoughtful Design: Hardwood View *** Over 2000 sqft Interior Space With Extensive Upgrades & Thoughtful Design: Hardwood Flooring throughout Main & 2nd; Custom Blinds & California Shutters; Oak Staircase with Wrought Iron Pickets; Spa-Inspired Bathrooms; Modern Kitchen with Quartz Countertops and A large Center Island, PLUS your Own Favorite Kitchen Appliances ... *** Over 300sqft Outdoor Space Including 3 Separate Balconies And A Large Rooftop Terrace with Gas Line Ready For BBQ, Great For Entertaining *** Proximity to Top Ranked Private and Public Schools, Public Transit, Shops on Don Mills, Various Parks *** Quick Access to Major Hwys DVP/404, 401 & 407, and Future Eglinton LRT *** A House With A Lifestyle, Dont Miss Out!!",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "2020",
        "ac_type": "Central Air",
        "laundry_type": "",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 2, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On the Park Dr 903, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,649,000",
        "description": "Welcome to Tridel-built Auberge on the Park. This luxury 3 bedroom and 3 bathroom condo suite offers 1665 sq ft of living space and is facing northwest, flooded with natural light from floor-to-ceiling windows , boasts a very large terrace, the perfect setting for delightful outdoor experiences. With an open, functional layout, storage is optimized, with plenty of closet space. Sunnybrook Park across the street, 6min walk to Line 5 LRT station, 5 min drive to DVP, 20min to downtown Toronto.",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1665",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 221, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,679,000",
        "description": "2 Parking Spots at Auberge on the Park - Tridel & Rowntree's latest statement in elevated luxury. nestled at the prestigious intersection of Leslie and Eglinton. Designed for those who appreciate sophistication, ease, and beauty, this exquisite 3-bed+den, 3-bath suite offers nearly 1,500 sqft of thoughtfully curated living space. This is not just a home its a lifestyle. From the moment you step inside, you'll be embraced by an airy, open-concept layout, 9ft ceilings, all adorned with high-end finishes and elegant touches throughout. Enjoy the convenience of two premium parking spots and a same-floor locker for effortless access. The gourmet kitchen flows seamlessly into the living and dining areas, ideal for entertaining or enjoying quiet moments at home. SS appliances, custom cabinetry, and luxurious detailing make every meal preparation a joy. Each of the three bedrooms is generously sized, filled with natural light from grand bay windows, and features ample storage including two custom walk-in closets. The spa-inspired primary ensuite offers a double-sink vanity and walk-in shower, ensuring a serene, stress-free start to your day. Comfort meets smart living with remote-controlled blinds in every room, in-suite laundry with a walk-in linen closet, and multiple built-in storage options. Positioned on a convenient level with direct building access, this suite is perfect for those seeking mobility and ease. The building itself is a sanctuary of amenities: an on-site dog park and dog-washing stations, an outdoor pool, state-of-the-art fitness centre, and beautifully landscaped grounds to stroll and unwind. Whether you're seeking a full-time residence or a Pied-a-Terre, this is luxury downsizing or upsizing without compromise all just steps away from the trails, tranquility, and beauty of Sunnybrook Park and Don River Valley Park. Minutes from the Eglinton LRT, DVP, Shops of Don Mills, SuperCentre, Costco, and more!",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1468",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jun 30, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On The Park Dr 3003, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,749,000",
        "description": "Step into unparalleled luxury with this exceptional 1655 sq. ft. condo, where every detail has been meticulously curated for an unrivalled living experience. Imagine cooking in a gourmet kitchen outfitted with state-of-the-art Miele appliances, including a built-in fridge and wall oven, all crowned by a breathtaking quartzite waterfall countertop. Floor-to-ceiling windows flood the space with natural light, illuminating the expansive interiors beneath 10-foot ceilings adorned with dimmable pot lights. Slide open the doors to your two sprawling private patios, each boasting custom flooring that invites both relaxation and elegant outdoor entertaining. Inside, a custom fluted media wall unit with back mount lighting offers endless storage while a glass-enclosed wine storage adds a touch of glamour. The hallways and powder room are graced with sophisticated venetian plaster, a testament to the $100k+ invested in upgrades. This is more than just a condo; its a masterful blend of luxury, style, and unparalleled comfort, waiting to become your new home.",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1655",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "30 Inn On the Park Dr 518, Toronto",
        "property_type": "Condo Apt 2-Storey",
        "price": "$1,789,000",
        "description": "Welcome to **Auberge On The Park** A Condo that feels like a HOUSE. Approx 1953Sqft+Terrace. This stunning, brand new and rare 2-storey condo boasts a spacious layout featuring **2 bedrooms + den** and **3.5 baths**. Enjoy expansive living spaces with separate **family, living, and dining rooms**, complemented by high ceilings and convenient **2nd-floor laundry**. The modern kitchen comes fully equipped with top-of-the-line **Miele appliances**, and front-loading washer and dryer. Step outside to a large terrace, perfect for relaxing or entertaining. Conveniently located with easy access to transit and highways, this move-in-ready home. Includes **1 parking**. Locker available for purchase. Don't miss out!",
        "bedrooms_number": "2",
        "washrooms_number": "4",
        "square_feet": "1953",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Fan Coil",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "10 Inn On The Park Dr 1710, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$1,899,000",
        "description": "Exquisite 3-Bedroom Corner Suite at Chateau Auberge with total of 1916 Sq. Ft. livable space consisting of indoor and outdoor, (1586+330sqft)of luxury living plus 2 premium Parking spaces, an upgraded exclusive Locker Room, Clear Southwest Exposure from 17th Floor Introducing the final and most prestigious phase of Tridel's Auberge on the Park.This luxury residence boasts sweeping, unobstructed views of Sunnybrook Park, the Toronto skyline, Eglinton Village, and North York City Centre, with breathtaking sunsets as your daily backdrop. Designed to impress, this 3-bedroom suite is drenched in natural light through 9-ft floor-to-ceiling windows, with an oversized-professionally floored-balcony framing west exposures for peaceful park and greenery views. The open-concept layout features: A gourmet kitchen w/ upgraded island & premium Miele appliances, An upgraded waterfall island, with ample luxury finishes throughout. The thoughtful layout separates the personal quarters from the entertaining spaces via a private hallway leading to: A primary retreat with a massive upgraded walk-in closet, a lavish 6-piece ensuite.Two additional bedrooms with closets and a spa-inspired 5-piece jack-Jill ensuite. This suite offers a perfect blend of elevated views and sheltered outdoor living. Resort-Inspired Amenities include: Extravagant grand lobby, Elegant party lounge with fireplace and catering kitchen Indoor pool and spa with outdoor lounging terrace High-end fitness centre overlooking landscaped surroundings Outdoor BBQ area, guest suite, and 24-hour concierge.",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1916",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 1, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "10 Inn On The Park Dr 901, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,150,000",
        "description": "Stunning 3-Bedroom Condo with Unobstructed Sunnybrook Park Views | TRIDEL New Build. Welcome to luxury living in this brand new Tridel-built condo offering breathtaking, panoramic views of Sunnybrook Park through floor-to-ceiling windows in every room. This spacious 3-bedroom unit features generous closets, an open-concept layout, and hardwood flooring throughout, combining elegance with functionality. Located just a minutes walk from the Eglinton & Leslie LRT station, commuting is effortless while you're surrounded by nature and greenery. The modern kitchen is a chefs dream, complete with high-end Miele appliances, a waterfall countertop island, and sleek cabinetry perfect for entertaining or everyday living. Building amenities are truly top-tier, including State-of-the-art fitness studio, Tranquil indoor pool and spa, Stylish entertainment lounge, Convenient pet wash station, Expansive outdoor terrace. Experience elevated urban living with every luxury and convenience at your fingertips. This is more than a home it's a lifestyle. Must See!",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "1724",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "23 Hollyhock Crt, Toronto",
        "property_type": "Detached 3-Storey",
        "price": "$2,250,000",
        "description": "DETACHED HOME ON CUL-DE-SAC - ONLY 4 YEARS OLD & FULLY UPGRADED Experience the best of newer construction with this pristine 4-bedroom, 4-bathroom detached home in sought-after Don Mills that delivers move-in ready luxury. Soaring tall ceilings and open-concept design flood the space with natural light while premium upgrades throughout include hardwood floors, granite countertops, polished Anatolia porcelain in kitchen, and rough-in central vacuum system already installed. The kitchen features top-tier appliances, upgraded island, and abundant storage making entertaining effortless. Your master suite becomes a private spa experience with soaking tub, walk-in shower, and dual vanities while three additional bedrooms offer generous closets and stylish upstairs bathroom. Step outside to custom landscaping surrounding your private backyard oasis where the extended deck system includes both main and upper levels perfect for dining, relaxing, or entertaining. Smart layout includes separate ground floor entrance from backyard adding flexibility for guests or potential income. Located on a quiet cul-de-sac, you're minutes to Shops at Don Mills with quick DVP and 401 access connecting you downtown fast. Four years new means no surprises, no settling issues, warranty protection still active, and all major upgrades complete. Book your viewing before it's gone.",
        "bedrooms_number": "4",
        "washrooms_number": "4",
        "square_feet": "2838",
        "ac_type": "Central Air",
        "laundry_type": "",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "Jul 3, 2025",
        "parking_type": "garage parking"
    },
    {
        "address": "10 Inn On The Park Dr 710, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,690,000",
        "description": "Exquisite 3-Bedroom Corner Suite at Chateau Auberge Over 2500sqf living space (2116sqf Interior + south balcony ~168sqf + west balcony ~246sqf) | 2 Parking + Locker | Southwest Exposure | 7th Floor Introducing a brand-new, never-lived-in southwest corner suite at Chateau Auberge, the final and most prestigious phase of Tridel's Auberge on the Park. Offering 2,116 sq. ft. of refined living space, this luxury residence boasts sweeping, unobstructed views of Sunnybrook Park, the Toronto skyline, Eglinton Village, and North York City Centre, with breathtaking sunsets as your daily backdrop. Designed to impress, this 3-bedroom suite is filled with natural light from 9-ft floor-to-ceiling windows. It features two expansive balconies: a 41-ft-long west-facing balcony offering a serene park view, and a 28-ft-long south-facing balcony showcasing vibrant city vistas. The open-concept layout features: A gourmet kitchen with premium Miele appliances A striking oversized pantry An upgraded waterfall island Luxury finishes throughout A thoughtful layout separates the personal quarters from the entertaining spaces via a private hallway leading to: A primary retreat with two walk-in closets, a lavish 6-piece ensuite, and walk-out to the balcony Two additional bedrooms with double closets A spa-inspired 5-piece bath with separate shower and enclosed water closet for privacy A powder room and in-suite laundry Positioned ideally on the 7th floor, this suite offers a perfect blend of elevated views and sheltered outdoor living, avoiding the wind exposure often found on higher levels. Resort-Inspired Amenities: Dramatic two-storey grand lobby Elegant party lounge with fireplace and catering kitchen Indoor pool and spa with outdoor lounging terrace, High-end fitness centre overlooking landscaped surroundings, Outdoor BBQ area, guest suite, and 24-hour concierge security.",
        "bedrooms_number": "3",
        "washrooms_number": "3",
        "square_feet": "2116",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Forced Air",
        "sale_or_rent": "for sale",
        "date_available": "May 21, 2025",
        "parking_type": "garage parking"
    }
]