[
    {
        "address": "15 Ellerslie Ave 2204, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,300",
        "description": "Welcome to Ellie Condo, a stunning one-bedroom unit in the heart of North York! This bright and functional south-facing suite is bathed in ultimate sunshine, featuring 9 ft smooth coffered ceilings and floor-to-ceiling windows that offer breathtaking, unobstructed views. The open-concept living, dining, and kitchen area creates a spacious and modern feel, complemented by a large balcony perfect for relaxation. Enjoy a spa-like experience with a luxurious soaker bathtub. Experience top-tier amenities, 24 hours concierge, Ample visitor parking.Conveniently located with the subway station and bus stop right at your doorstep, you'll have easy access to shopping, parks, restaurants, and more. Dont miss this incredible opportunity to live in one of North Yorks most sought-after condos!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "499",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease"
    },
    {
        "address": "35 Rolling Mills Rd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,300",
        "description": "Perfectly located in Toronto's Vibrant Canary District. This perfect one-bedroom suite offers an underground parking spot and a spacious east-facing balcony. Designed with an open-concept layout, it features floor-to-ceiling windows, 9-foot ceilings, hardwood flooring, modern window coverings and sleek contemporary finishes throughout. The suite comes fully equipped with a built-in fridge/freezer, microwave, dishwasher, and a sleek stainless steel stove. High speed Internet and 24-hour concierge services are also included for your convenience.Top-Tier Building Amenities: State-of-the-art fitness and yoga studio, theatre room, hobby room, party room, game room, meeting room, community BBQs, rooftop terrace with stunning city views, and community EV charging stations in underground .Prime Location: Overlooking lush green space and just steps from the 18-acre Corktown Common Park, this condo is ideally situated only minutes from the waterfront in the sought-after Canary District. Enjoy walking access to restaurants, cafes, shops, the YMCA, and other local attractions. Discover the best of Toronto with nearby hotspots including the Distillery District, Front Street Promenade, St. Lawrence Market and more.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease"
    },
    {
        "address": "1630 Queen St E, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,300",
        "description": "Discover luxury living in the Beach with this exquisite 1+1! Convenience is key with direct access to the streetcar line right at your doorstep. The open-concept floor plan seamlessly connects the living spaces, and a M-A-S-S-I-V-E North facing terrace with views of the city! The large den offers versatility and can serve as an office or home gym. Commuting is a breeze with straightforward access to the Gardiner and DVP, and the impressive transit score of 89 and walk score of 95 make everyday living exceptionally convenient. In addition to the prime location and stunning green spaces, residents can enjoy a gym, rooftop deck, party room and dog washing station. This condo isn't just a place to live; it's a complete lifestyle package!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Forced Air",
        "sale_or_rent": "for lease"
    },
    {
        "address": "5500 Yonge St, Toronto",
        "property_type": "Comm Element Condo Apartment",
        "price": "$2,300",
        "description": "Convenient location with all kinds of shops, restaurants, stores & metro systems. Beautiful layout, bright balcony, one parking and one locker are included.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "5500 Yonge St, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,300",
        "description": "Prime Location At Yonge/Finch-Subway At Door** Higher Floor With Quiet South/West Unobstructed City View**Parking** Locker**Good Size Of Room & Oversized Balcony **Large 1 Bdrm ** Modern Kitchen** 24 Hours Concierge And Security** Gym, Party Room, Guest Suites, Billiard & Ping-Pong Table.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "15 Baseball Pl, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,300",
        "description": "Welcome to this beautiful and modern 1 bedroom & 1 underground parking space suite located in the heart of the trendy Riverside neighbourhood! Featuring 9 ft ceilings, sleek contemporary finishes, built-in appliances, and floor-to-ceiling windows that fill the space with natural light. This thoughtfully designed condo is part of a vibrant master-planned community known for its walkability, access to local cafes, restaurants, and shops. Easy access to TTC, the DVP, and Gardiner Expressway makes commuting a breeze! Top-tier amenities include: 24-hour concierge, stunning rooftop pool with sun deck, fully equipped fitness centre, stylish party room, guest suites for visitors! Live, work, and play in one of Toronto's most sought-after neighbourhoods!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "18 Harrison Garden Blvd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,350",
        "description": "Welcome to Your New Home in the Heart of North York! This spacious and functional 1-bedroom condo offers a perfect blend of style, comfort, and convenience. Perched on the 26th floor, this unit features a bright open-concept living space, parking, locker, and a private balcony with stunning unobstructed east-facing views of the city. Beautifully upgraded throughout, the primary bedroom comfortably fits a king-sized bed and boasts a walk-in closet. Updated lighting and a refreshed bathroom complete this move-in-ready gem. Located steps from Whole Foods, Longos, shops, and top-rated restaurants, this condo offers unbeatable convenience. With TTC subway access just steps away and quick connections to Hwy 401, commuting is effortless. Don't miss this opportunity to live in a beautifully appointed unit in one of Toronto's most vibrant neighborhoods! The building also offers exceptional amenities, including a 24-hour concierge/security, an indoor pool, a gym, and more!",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 Adra Grado Way, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,350",
        "description": "Absolutely Stunning, TWO Entrances, ONE private Entrance, Unobstructed East Facing, Brand New Luxury Condo By Tridel, Open Concept Living. Modern Kitchen With Integrated Dishwasher, Quartz Countertop And Backsplash, Stainless Steel Appliances, Contemporary Cabinetry, Luxury Amenities, Conveniently Located: Minutes To Leslie Subway, Fairview Mall, Bayview Village, Ikea, North York General Hospital, Hwy 401, Hwy 404. Resort Style Amenities: Indoor/Outdoor Pools, Gym, Sauna, Etc. ONE storage locker( locker 405)11 ft ceiling",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "7 Lorraine Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,350",
        "description": "Don't miss out this Spacious, Bright 1+Den Condo with functional layout with generous living space, this 1-bedroom plus den unit offers comfort and versatility. The open-concept floor plan is perfect for working from home or entertaining. Prime location with direct underground access to subway, steps to shops, restaurants, and more. ?? Spacious & Functional Layout ? Den Perfect for Office or Guest Room Well-Maintained Building with Great Amenities Parking Included ? Walk Score of 95 - Everything at Your Doorstep",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "15 Baseball Pl, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,350",
        "description": "Welcome to the perfect fusion of vibrant downtown living and welcoming neighbourhood charm. This bright, south-facing condo offers sweeping, unobstructed views and an abundance of natural light throughout the day. What truly sets this home apart is the massive full-sun terrace a rare find in the city that feels like your own private outdoor oasis. Whether you're entertaining guests, soaking up the sun, or growing your own herb garden, this expansive outdoor space seamlessly extends your living area.Inside, the intelligently designed layout offers flexibility to suit your lifestyle with room for a kitchen island, dining area, home office, den, or added storage.Located just steps from the downtown core, you're within easy reach of Torontos best restaurants, the 24-hour Queen streetcar, DVP, waterfront bike paths, Cherry Beach, and Riverdale Park. All of this, plus excellent building amenities including a standout pool and fitness centre, make this a truly exceptional place to call home.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "95 McNahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,380",
        "description": "Luxury Living in Concord Park Place, Spacious 1 Bedroom 1 Bath with Balcony Equipped with Composite Wood&Decking with Radiant Ceiling Heater, Features 9-Ft Ceiling, Spa Like Bath with Large Porcelain Titles, Walking Distance to Brand New Community Centre And Park, Steps to 2 Subway Stations Bessarion&Leslie, Min to Hwy 401/404, Go Train Station, Bayview Village &Fairview Mall, With 80,000 sqft of Amenities, Tennis/Basketball Crt/Swimming Pool/Sauna/Whirlpool/Hot Stone Loungers/BBQ/Bowling/Fitness Studio/Yoga Studio/Golf Simulator Room/Children Playroom/Formal Ballroom and Touchless Car Wash etc.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "68 Canterbury Pl, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,390",
        "description": "Truly A Must See 1+1 With 2 Full Baths Unit. Over Looking East View. 9' Ceiling, After A Long Day, Enjoy Your Evening In The Open-Concept Living Room With Morden Kitchen, Relax In Your Primary Bedroom With Ensuite Bath And Picture Windows. Rm Sized Den Is Perfect For Families Or Setting Up As An Office. Convenient Access To Subway, Hwy 401/Dvp. Great Amenities Incl. Concierge, Exercise Room, Recreation Room & So Much More!",
        "bedrooms_number": "1+1",
        "washrooms_number": "2",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "18 Parkview Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,400",
        "description": "Well-Maintained, Spacious Condo In Prime Location. Steps To North York Ttc Subway. W/O From Living Rm & Master Bdrm To Expansive Balcony W Glass Railing. Close To All Amenities: Loblaws, Shopping, Restaurants, Theatre/Arts Centre, Library & More! Modern Renovated Lobby & Common Areas. Enjoy Party & Conf Rms, Sauna, Whirlpool, Billiard & Media Rms, 24 Hr Security, Ample Visitor Pkg. Photos are previous listing photos.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "50 O'Neill Rd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,400",
        "description": "Ready for Move in! Experience luxury living at Rodeo Drive where convenience meets style. Be the trendsetter in this sophisticated newer 1+1 unit located at The Shops at Don Mills. This exclusive \"Sunset\" end unit boasts floor-to-ceiling windows, flooding the space with natural light. Begin your day by grabbing a Starbucks and enjoying it on your expansive balcony. Indulge in the culinary delights just steps away from your doorstep if you prefer dining out. The unit features modern finishes throughout, with sleek panelled, built-in appliances in the kitchen. With the TTC right at your doorstep, accessing the subway is a breeze. The DVP is minutes away connecting you to all other highways. This prime location also puts you in proximity to public and private schools, universities, hospitals, museums, the science center, and more, ensuring a vibrant and well-connected lifestyle. Shop for the latest fashion trends, pamper yourself at the hair salon, and conveniently pick up groceries or a bottle of wine. Welcome home! Parking included!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "30 Harrison Garden Blvd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,400",
        "description": "Discover luxury living in North York with this exquisite 1+1. Convenience is key with direct access to two subway lines right at your doorstep.The open-concept floor plan seamlessly connects the living spaces, and the modern kitchen is a chef's dream, complete with a spacious breakfast bar, appliances, and a double sink. The large den offers versatility and can serve as a second bedroom or home office. Commuting isa breeze with straightforward access to the 401, and the impressive transit score of 92 and walk score of 83 make everyday living exceptionally convenient. In addition to the prime location and stunning views, residents can enjoy a host of exceptional amenities, including a sauna, fully-equipped gym, guest suites, party room, visitor parking, and the peace of mind provided by the 24-hour concierge. This condo isn't just a place to live; it's a complete lifestyle package.",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "4955 Yonge Street, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,400",
        "description": "Welcome to this bright and spacious condo in the heart of North York City Centre, just steps from Sheppard-Yonge and North York Centre subway stations. This thoughtfully designed unit features 1 Bedroom + Den (which can be used as a second bedroom) and a full washroom, with an open-concept layout, 9-foot ceilings, and elegant laminate/hardwood flooring throughout. Floor-to-ceiling windows and doors flood the space with natural light and offer stunning views of Yonge Street.The modern kitchen boasts sleek cabinetry, quartz countertops, and stainless steel appliances perfect for cooking and entertaining. Enjoy top-tier amenities including a fully equipped gym, stylish party room, rooftop terrace with city views, and an indoor swimming pool coming soon.Live just moments from Loblaws, Empress Walk, the Yonge-Sheppard Centre, and a wide selection of boutique restaurants, cafes, and entertainment options. The vibrant theatre district is also just around the corner!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "None",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "286 Main St, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,400",
        "description": "Location! Location! Location! Welcome To Linx Condos, By Tribute Communities, This Modern And Spacious One-Bedroom Plus Den Unit Offers A Generous Layout, With The Den Large Enough To Serve As A Second Bedroom. Step to main Street Subway. Enjoy Stunning South West-Facing Views Of TheCN Tower, Downtown Core And Lake Ontario. Upgrades Include A Stylish Backsplash, Mechanical Remote-Control Blinds, A Tempered Glass Shower Enclosure, And A Private Balcony. Conveniently Located to Danforth GO Train Station, This Makes Commuting To The Downtown Core And Surrounding Areas A Breeze. This Vibrant And Diverse Community Offers A Multitude of Shops, Parks And Restaurants At Your Fingertips. Building Amenities Offer A 24 Hour Concierge, A Fully Equipped Gym, A Extensive Outdoor Terrace With BBQ Areas, Party Rooms, A Media Lounge, A Childs Playroom, Bike Storage And More.",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "None",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 McMahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,450",
        "description": "Brand New Luxury Building In Concord Park Place Community Featuring Exceptional CN Tower Views. 505 Sqft Of Interior + 198 Sqft Of Balcony. With 80,000 Sqft Of Amenities, Tennis/Basketball Crt/Swimming Pool/Sauna/Formal Ballroom And Touchless Car Wash, etc. Features 9-Ft Ceilings, Floor To Ceiling Windows, Laminate Floor Throughout, Roller Blinds, Premium finishes, Quartz Countertop, Spa Like Bath With Large Porcelain Tiles. Balcony With Composite Wood Decking With Radiant Ceiling Heaters Looking To Toronto Skyline. Steps To Brand New Community Centre And Park, minutes walk to Bessarion & Leslie Subway Station, Go Train Station, And Minutes To Hwy 401/404, Bayview Village & Fairview Mall.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 McMahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,450",
        "description": "Experience exceptional urban living in this brand-new 1-bedroom plus den condo with one parking and a locker, ideally located in the heart of North York within Concords prestigious new development. This SOUTH-facing suite offers 505 sq.ft. of thoughtfully designed interior space, plus a generous 193 sq.ft. balconyThe open-concept layout is bright and modern, featuring sleek finishes, wide-plank flooring, and a gourmet kitchen equipped with premium Miele appliances and custom cabinetry. The spa-inspired bathroom provides a relaxing retreat, while floor-to-ceiling windows flood the unit with natural light.Enjoy the added convenience of an parking stall and a dedicated storage locker. Residents have access to an impressive selection of world-class amenities, including a state-of-the-art fitness centre, luxurious indoor swimming pool, and a touchless automatic car wash. Outdoor areas include a serene French garden, an English garden with an al fresco BBQ patio, and a childrens play zone. For leisure and entertainment, take advantage of the golf simulator, elegant wine lounge, and grand ballroom.Set in a dynamic and convenient neighborhood, this exceptional home offers the perfect blend of comfort, style, and lifestyle-enhancing amenities.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "188 Doris Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,500",
        "description": "Nestled in the vibrant heart of North York. just minutes away from the subway, shopping centers, and restaurants. Bright space, gorgeous brand new kitchen with SS appliances, stone countertop. Furnished with bed, TV stand, desk, and dining table. Fantastic amenities, including an indoor pool, hot tub, gym, visitor parking, and a party room.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "33 Singer Crt, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,500",
        "description": "Luxury 1+1 Condo * Large Den Can Be The 2nd Bedroom * 718 Sq.Ft. + 112 Sq.Ft Balcony. Modern Finished With Granite Counter In Kitchen & Bath. Steps To Subway & Bus Station , Walking Distance To Ikea, Canadian Tire, Bank, Shopping Centre ( Bayview Village )& Supermarket. Easy Access To Fairview Mall, Hwy 401 & 404. Amenities: Concierge, Gym, Indoor Pool, Basketball, Billiards, Hot Yoga Rm, Party Rm, Karaoke, Guest Suites.",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 Greenview Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,500",
        "description": "Most Luxurious, Award Winning Tridel Building In The Heart of North York. Minutes Walk To Yonge & Finch Subway Station. Beautifully, Bright and Well Kept Unit, The Den Has A Door, could be a second bedroom or a private office . Huge Bedroom contains shelf built-in walk-in closet. Freshly Painted/Professionally Cleaned and Move-In Ready and Enjoy! Open Concept Functional Layout With Full Size Kitchen and Large Living and Dinning Area. Directly Walkout To Terrace. Minutes Walk Schools, Shopping, Restaurants, Entertainment. Million Dollars Amenities, Virtual Golf, Indoor Pool, Billiard, Library, Guest Suites, Grand Lobby, 24 hour concierge. 1 Parking, 1 Locker included.",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "60 Byng Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,500",
        "description": "Sophisticated Urban Living at The Monet. Step into elevated city living with this beautifully upgraded 1+1 bedroom, 1 bathroom suite. Whether you're a first-time buyer, downsizer, or investor, this thoughtfully curated residence offers the perfect combination of style, comfort, and smart design. Inside, you're welcomed by a crisp, modern white kitchen and freshly painted interiors that set a clean, inviting tone. The open-concept layout is bathed in natural light, thanks to floor-to-ceiling windows and unobstructed views adorned with newly updated modern roller shades for privacy. Soaring 9-foot ceilings add a sense of grandeur, making every inch of the space feel bright and expansive. Flexible glass-enclosed den adds functionality. Updated floors through the main living areas, primary bedroom, & solarium, plus custom built-in shelving in the bedroom. Steps from Finch station, GO transit, and the 401, and surrounded by local cafes, restaurants, shops, everyday essentials and more. The Monet offers luxury and convenience at your doorstep!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "3 Everson Dr, Toronto",
        "property_type": "Condo Townhouse Stacked Townhse",
        "price": "$2,500",
        "description": "A Lovely And Cozy One Bedroom Plus Den Two Storey Stacked Townhouse Located In Prestige Yonge & Sheppard Area. This Popular Anndale Layout Is Sought After For Its Efficient Plan On Two Levels. Well Maintained place, Large Windows with a ton of natural light. Walking Distance To Groceries, Parks, Restaurants, Bars, And More. Easy Access To Ttc, Hwy 401 & Golf Course. Move Right In And Enjoy!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "30 Inn On The Park Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,500",
        "description": "Available Immediately!! Welcome to AUBERGE, Tridel's newest landmark in North York! MOVE INASAP! This luxury 1 Bedroom + den/1 Bathroom condo suite offers 650 sq ft of living space. No Carpet-Laminate flooring throughout, premium kitchen with tons of storage, built in appliances, premium countertop. Living/Dining room area opens to a juliette balcony and offers views of East Toronto. Primary bedroom offers east views, one walk in closet closet. Extras** Upscale amenities include state-of-the-art fitness center, yoga room, the grand entertainment lounge, or the multi-purpose lounge, lobbies. Steps from the New Eglinton LRT Line.",
        "bedrooms_number": "1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite, Laundry Room",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "27 McMahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,590",
        "description": "Luxury Building in Concord Park Place Community. 530 Sqft Of Interior + 163 Sqft Of Balcony. With 80,000 Sqft Of Amenities, Tennis/Basketball Crt/Swimming Pool/Sauna/Formal Ballroom And Touchless Car Wash, etc. Features 9-Ft Ceilings, Floor To Ceiling Windows, Laminate Floor Throughout, Roller Blinds, Premium finishes, Quartz Countertop, Spa Like Bath With Large Porcelain Tiles. Balcony With Composite Wood Decking With Radiant Ceiling Heaters Looking To Toronto Skyline. Steps To Brand New Community Centre And Park, minutes walk to Bessarion & Leslie Subway Station, Go Train Station, And Minutes To Hwy 401/404, Bayview Village & Fairview Mall.",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "27 McMahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,600",
        "description": "Welcome to Saisons - the most luxurious residence in North York! This gorgeous designer one bedroom plus den condo offers the highest quality finishes, from integrated Miele appliances, marble bathrooms and premium heated balcony with composite wood decking! This smart floor plan maximizes square footage and opens up to 9 ft ceilings and floor to ceiling windows. Custom fitted roller blinds, smart bathroom and closet organizers are designed for your utmost convenience and enjoyment. Conveniently located steps from the park, community centre, TTC and Go Train stations and featuring some of the best amenities with an 80,000 sqft Mega Club. Includes basketball, tennis, bowling, putting green, indoor pool and much more!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "17 Kenaston Gdns, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,600",
        "description": "Spacious and Stylish 1+Den, 2-Bath Suite in the Heart of Bayview Village! This functional layout offers a generous open-concept living area, a modern kitchen with stainless steel appliances and granite counters, and a large den that can be used as a home office or guest space. Primary bedroom features an ensuite bath and ample closet space. Enjoy two full bathrooms, in-suite laundry, and a private balcony. Steps to Bayview Subway, Bayview Village Mall, Loblaws, and quick access to Hwy 401. A+ location with top-notch amenities!",
        "bedrooms_number": "1+1",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "3 Everson Dr, Toronto",
        "property_type": "Condo Townhouse Stacked Townhse",
        "price": "$2,600",
        "description": "Premium Yonge & Sheppard Condo Townhouse Street-Level Access & Private Rooftop Oasis This highly sought-after condo townhouse is perfectly situated in the heart of Yonge & Sheppard, just steps from TTC, Hwy 401, top-tier shopping, dining, parks, and more. This upgraded unit combines convenience with a sense of privacy and exclusivity. Enjoy an expansive private rooftop terrace overlooking the park an ideal space for entertaining or relaxing with a view. Inside, the bright, open-concept layout features a stylish and functional living area perfect for modern urban living. Unit comes with included parking and locker as well! Dont miss this premium unit in one of North Yorks most desirable locations!",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "233 Beecroft Rd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,700",
        "description": "Prime North York Location | All-Inclusive Living Welcome to the heart of North York! This bright and spacious unit offers unobstructed views and unbeatable convenience. Just steps to the Subway, North York Centre, parks, schools, library, and a wide range of grocery stores including Loblaws, Metro, Galleria, and H-Mart. Enjoy close proximity to restaurants, pharmacies, banks, and even a movie theatre everything you need is just around the corner. Building amenities include 24-hour concierge service, secure package lockers, visitor parking right next to the lobby, a stylish party room, and a fully equipped gym. All utilities are included in the maintenance fee: heat, hydro, water, and central air conditioning.Comes with one parking spot and a locker.",
        "bedrooms_number": "2",
        "washrooms_number": "1",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "21 Clairtrell Rd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,720",
        "description": "Luxurious 1+1 Bed, 2 Bath Condo in Prime Bayview Village Location. Bright and spacious suite in an upscale low-rise boutique building, offering over 750 sq ft of well-designed living space. Features include a versatile den (ideal as a home office or guest room), two full bathrooms, 9-ft ceilings, hardwood floors, a modern kitchen with quartz countertops, and a private balcony. Includes 1 underground parking space. Unbeatable location, just a 5-minute walk to Bayview Subway Station and minutes to Hwy 401, 404, and DVP. Steps to Bayview Village Mall, YMCA, Loblaws, and more. Exceptional building amenities: rooftop terrace with BBQs, party room, fitness centre, guest suite, and 24-hour concierge.",
        "bedrooms_number": "1+1",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "275 Broadview Ave, Toronto",
        "property_type": "Condo Townhouse 3-Storey",
        "price": "$2,750",
        "description": "This spacious 3-bedroom, 2-bathroom condo townhouse is just minutes from downtown Toronto, offering convenience and accessibility. Located close to all amenities, it provides easy access to a 24-hour streetcar, the DVP Highway, and is a short walk to Queen St. shops, Riverdale Park, Danforth Ave. restaurants, and Bridgepoint Health Hospital. Featuring laminate flooring throughout, and a fenced backyard, this home boasts a functional layout that is both bright and spacious. Ideal for families, professionals, or students seeking a comfortable and well-connected urban lifestyle. ** NO parking**",
        "bedrooms_number": "3",
        "washrooms_number": "2",
        "square_feet": "1399",
        "parking_type": "Built-In",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "1 Pemberton Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,800",
        "description": "Steps To Finch Subway Station! Bright & Spacious Corner Unit With Furniture. 21st Floor High Level W/ Unobstructed City View. Large Den With Door & 2 Side Windows Can Be The 2nd Bedroom. Laminate Flooring Throughout. 24 Hrs Concierge, Gym, Sauna, Party Room & Visitor Parking. Steps To Ttc, Shopping & Restaurant. Close To Civic Centre & Shopping Mall. Mins Hwy401/404...Steps To Finch Subway Station, Yrt Main Station, Restaurants & Shops.",
        "bedrooms_number": "2",
        "washrooms_number": "1",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "23 Lorraine Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,900",
        "description": "Bright corner suite with lots of sunlight. Master bedroom with 4pc ensuite, large closet with mirrors, party room, gym, swimming pool, guest suite. Close to Yonge and Finch. Many young family in the area. Very lively area with lots of shops and food places nearby.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "19 BARBERRY Pl, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,900",
        "description": "High Demand Bayview Village Area! Chelsea By Daniel, Fantastic South/West Corner Unit W/Full Of Sunlight, Granite Counter Top, Back Splash In Kitchen, W/O Balcony From Living Room Hardwood Flr In Living/Dining. Separate Bedrms. Spacious Master W/3Pc Ensuite & W/I Closet.. Gorgeous View Of Cn Tower. Building Features Internet Cafe/Lounge/Party Rm W/Bbq's, Game Rm, Board Rm & Exercise Room. Steps To Subway, Bayview Village Mall, Chapters, Ymca And Hwy 401,404",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "None",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "18 Harrison Garden Blvd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,900",
        "description": "Absolutely Stunning Two Bedroom At The Residence Of Avondale By Shane Baghai In North York, Beautiful West Exposure With Balcony. Open Concept, Easy Access To Yonge And Hwy 401. Walking Distance To Subway, Shops, Schools And Restaurants! 24 Hrs Concierge And Fantastic Facilities - Indoor Pool, Sauna, Gym, Party Rm,Guest Rm And More",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "2 Anndale Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,950",
        "description": "Bright Tridel's luxury condo in North York! Spacious one + den. Large window to show beautiful \"south view\". Premium, modern built-in kitchen, oversized enclosed den (work from home). Great, effective floor plan with plenty of natural light. Direct subway connection, Whole Foods, banks, etc... Walk to almost everything. Includes one parking spot and one locker. Ready to move-in. Upgraded mirror closets.",
        "bedrooms_number": "1+1",
        "washrooms_number": "1",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "28 Olive Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,950",
        "description": "Spacious 2-bedroom condo for lease at Yonge and Finch, offering unbeatable location and excellent value. Situated just steps from Finch Subway Station, this bright and well-maintained corner unit features a split-bedroom layout ideal for roommates or professionals seeking privacy. With over 900 sq ft of living space, it is significantly larger than most newer condos in the area. Enjoy a full-sized kitchen, open-concept living and dining area, and a walk-out balcony with clear views. Rent includes all utilities heat, hydro, and water as well as one underground parking space. The building is professionally managed and offers 24-hour concierge, gym, party room, and visitor parking. Conveniently located near public transit, grocery stores, cafes, restaurants, and more, this unit delivers comfort, space, and exceptional urban access in the heart of North York.",
        "bedrooms_number": "2",
        "washrooms_number": "1",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "121 Mcmahon Dr Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$2,950",
        "description": "Stunning Penthouse With 10-Ft High Ceilings. The Bedroom Suite Is Bright And Inviting, The Newest And Largest Community Center, Beautiful Park a ,Subway, a 24-Hour Bus, Elegant And Quiet Environment. Parking is not including the listing price.",
        "bedrooms_number": "3",
        "washrooms_number": "2",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In Area",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 Adra Grado Way, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,000",
        "description": "This luxury 2 bedrooms, 2 bathrooms condo at Scala offers 785 square feet of living space, a Private entrance (TWO total entrances), 9 foot ceilings, floor-to-ceiling windows, and an open concept living space. This suite comes with energy efficient 5-star modern kitchen, integrated dishwasher, quartz countertops, contemporary soft close cabinetry, in suite laundry, and window treatments. This suite also includes a secured locker and an underground parking spot.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "425 Front St E, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,000",
        "description": "Welcome to your new home at Canary House Condos, located at Front and Cherry Streets. This beautiful 2-bedroom, 2 washroom Condo + a versatile den makes for an ideal home office or cozy retreat. Enjoy exclusive amenities like a 24/7 concierge, fitness studio, entertainment room, party room, and a rooftop garden terrace with BBQ lounge, fire pit, and Zen Garden. Steps away from TTC streetcar and bus services, commute to Union Station in under 30 minutes. High Walk Score, nearby 18-acre Corktown Common Park. Minutes away from Toronto's premier arts and entertainment hub. Perfect for Students: Close proximity to George Brown College and easy transit to Ryerson University. Make Canary House your urban oasis today! Parking $200 extra per month.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "78 Harrison Garden Blvd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,000",
        "description": "Location! Location! Location! Luxury @ Its Best! Prestigious Skymark In The Heart Of Avondale Community. Million $ State Of The Art Amenities; Virtual Golf, Bowling, Billiard And Card Room, Library And More! This Bright & Upgraded 2Br/2Wr Has Upgrades! Breathtaking Panoramic View Of Ny City Centre And Yonge. Unit Features new laminate floors, Granite Counters, Large Windows. One of the most desirable buildings in the neighborhood, very clean and family oriented building.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "8 Pemberton Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,000",
        "description": "Penthouse. Unobstructed View, Upgrade Laminated Floor Throughout. Well Maintained, New Kit. Countertop, Split Bedroom, Good Layout, Direct Access to Subway. A.A.A Tenant Only. No Pets, No Smoking.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "181 Wynford Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,000",
        "description": "Step into sunshine and style in this bright Tridel-built corner unit where southwest views light up your life! This 2+1 bed, 2-bath beauty brings space, comfort, and a touch of luxury to your everyday. The open living/dining areawith sleek laminate floorsflows seamlessly to your private balcony, perfect for sunsets or Sunday coffee. Cook like a pro in the generous kitchen with ceramic floors and plenty of storage. The primary suite? A dreamwith its own 4-piece ensuite and balcony access. The second bedroom is cozy with plush carpeting, and the den is ideal for your WFH setup or creative escape, framed by French doors. All tucked into a prestigious building with 5-star amenities. Come see why this one feels like home.",
        "bedrooms_number": "2+1",
        "washrooms_number": "2",
        "square_feet": "499",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "260 Doris Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,100",
        "description": "Utilities Included! Located In The Heart Of North York In One Of The Most Desirable Neighbourhoods! Subway At Your Doorstep! Rarely Offered! Well-Maintained 2 Bed Unit With Large Windows And Lots Of Natural Light. The Unit Also Has A Walk-Out To Balcony With Beautiful Unobstructed Views. Primary Bedroom Comes With Large Closets And An Ensuite Bath. Spacious Second Bedroom Is Perfect For A Home Office or Guest Room! Come And Take A Look!",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 Mcmahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,100",
        "description": "Built by Concord Adex, Brand new Luxurious Bright 2 Bedrooms Corner Unit At Saisons Condos In High Demand Bayview Village! 9' Ceiling! Laminate Floor & Floor To Ceiling Window Throughout! Living Room Walk-Out To An Ample-Sized Sqft Balcony With West View & Natural Bright Sunlight! Split TwoGood Sized Bedrooms With Two Full Size Bath! Open Concept Kitchen With Built-In Modern Appliances, Granite Countertop, Backsplash & Undermount Sink. Balcony Features Radiant Ceiling Heaters, Wood-grain Soffit Ceiling Treatment And Composite Wood Decking.Unit come with one parking and one locker. 24 Hrs Concierge, Steps To TTC Subway Station! Mins To Highway 401,404 & Dvp, North York General Hospital, Bayview Village Shopping Mall & Fairview Mall, Shuttle Bus To Go Station & Mall. Mega Club Amenities Include Outdoor Lounge, Swimming Pool, Gym / Exercise Room, And Party Room.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "15 HOLMES Ave S, Toronto",
        "property_type": "Co-Op Apt Apartment",
        "price": "$3,100",
        "description": "Beautiful Bright Unit Facing South With A Large Balcony And One Parking. Floor To Ceiling Windows, Large Balcony, Sleek Modern Finishes Steps Away From Amazing Outdoor Amenities. Steps Away From Ttc, Trendy And Delicious Restaurants, Groceries, Lcbo, Great Schools And So Much More! Enjoy The Convenience Locations Gives While Resting In Your Beautiful Home Or Start The Night With Friends Before Stepping Out For The Evening.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "699",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "1 Rean Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,200",
        "description": "Welcome to luxury living at New York Towers, ideally situated in the prime Sheppard and Bayview area. This beautifully furnished two-bedroom, two-bathroom unit offers both comfort and style, featuring a bright eat-in kitchen with a walk-out to the balcony, and a guest bedroom that also opens to the outdoor space perfect for enjoying fresh air and natural light. With all utilities included in the rent, this is a worry-free living experience in one of North York's most desirable locations. Just steps from Bayview Village Mall, Loblaws, Shoppers Drug Mart, Bayview Subway Station (only a 5-minute walk), Highway 401, parks, top-rated schools, restaurants, and the YMCA, convenience is truly at your doorstep. The unit comes fully furnished, including all furniture shown in the photos, as well as a fridge, stove, built-in dishwasher, washer and dryer, all existing light fixtures, and window coverings. Enjoy an impressive array of building amenities, such as an indoor swimming pool, whirlpool, sauna, fully equipped gym, yoga studio, virtual golf room, billiards and ping pong rooms, a party room, card/meeting room, library, guest suite, and a beautifully landscaped BBQ patio with a sun deck. This is a unique opportunity to live in a vibrant, well-connected community simply move in and enjoy.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "25 McMahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,200",
        "description": "Built by Concord Adex, one year new Luxurious Bright 2 Bedrooms Corner Unit At Saisons Condos In High Demand Bayview Village! 9' Ceiling! Laminate Floor & Floor To Ceiling Window Throughout! Living Room Walk-Out To An Ample-Sized Sqft Balcony With West View & Natural Bright Sunlight! Split In two good size Bedrooms With Two Full Size Bath! Open Concept Kitchen With Built-In Modern Appliances, Granite Countertop, Backsplash & Undermount Sink. Balcony Features Radiant Ceiling Heaters, Wood-grain Soffit Ceiling Treatment And Composite Wood Decking. Unit come with one parking and one locker. 24 Hrs Concierge, Steps To TTC Subway Station! Mins To Highway 401,404 & Dvp, North York General Hospital, Bayview Village Shopping Mall & Fairview Mall, Shuttle Bus To Go Station & Mall. Mega Club Amenities Include Outdoor Lounge, Swimming Pool, Gym / Exercise Room, And Party Room.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "88 Grandview Way, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,250",
        "description": "Yonge Street Just South Of Finch, Tridel Built, 2+1Bedrooms, 2 Bathrooms, Renovated Kitchen, Great Unobstructed View. Bright And Sunny, 24 Hours Gatehouse Security, Walk Across To Metro Super Market, Restaurants, Entertainment And Schools.5 Minutes To Subway Station, One Underground Parking And One Locker Included In Rental Price. Stainless Steel Fridge, Stove, B/I Dishwasher, B/I Microwave, Stacked Washer And Dryer, One U/G Parking, Tenant Pays Utilities Including Hydro, Gas And Hot Water Tank. (Water Is Included In The Rent).All showing required 24 hr notice.",
        "bedrooms_number": "2+1",
        "washrooms_number": "2",
        "square_feet": "1199",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "105 Harrison Garden Blvd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,250",
        "description": "LIMITED TIME PROMOTION- JULY MONTH FREE* Spacious Two Bedroom + Den (888 Sq Ft) Suite W/Loads Of Upgrades & Quality Finishes. Open Concept Kitchen, S/S Appliances & Quartz Countertops. Laminate Floors. Amazing Amenities! Free Fitness Classes, Yoga Studio, Spin Bikes, Steam Room, Luxury Lounge Free Netflix & Wifi, Private Outdoor Terrace With Bbq's. 24Hr Concierge & Sec., Bus. Centre, Onsite Dry Cleaning, Package Service. Virtual Events, Pet Friendly W/Pet Events Stainless Steel (Fridge, Stove, B/I Micro/Range, B/I D/W) Washer & Dryer. Underground Parking Available $175/Month. Locker $100/Month. Bike Storage. 24 Hr Customer Care & Maintenance Guarantee. Photos Are Of Model Suite. See Attached Floor Plan and Virtual Tour Link",
        "bedrooms_number": "2+1",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "27 McMahon Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,370",
        "description": "One-year-new luxurious and bright east-facing 2-bedroom unit with abundant natural light and a spacious balcony featuring a radiant ceiling heater. This unit offers 9-foot ceilings, a large EV parking space, and a private locker. The primary bedroom includes a 4-piece ensuite and a walk-in closet with custom organizers. Enjoy premium finishes throughout, including Miele appliances, quartz countertops with Calacatta backsplash, and a Miele washer & dryer. Enjoy exclusive access to the Megaclub, featuring a basketball court, swimming pool, fitness gyms, golf simulator, ballroom, and more. Conveniently located near Bessarion and Leslie subway stations, the new community centre, and just minutes from Hwy 401/404, Bayview Village, Fairview Mall, IKEA, Canadian Tire, and more. One EV Parking & One Locker Included. Photos were taken prior to the current tenant moving in.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "33 Frederick Todd Way, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,400",
        "description": "Welcome to Leaside! This sun-filled South West corner suite meets all wants. Split 2 bedroom unit with 3 bathrooms. European style kitchen w/ centre island, 9ft ceiling, Unobstructed views and lots of light. Desirable and functional layout. Easy access to 404, Sunnybrook Hospital, Aga Khan Museum & Edwards Gardens. Steps to LRT, 3 stops to Yonge/Eglinton. Internet included! Parking available from builder at additional cost. Schools:Rolph Road ES, Bessborough Drive E & MS, Leaside HS",
        "bedrooms_number": "2",
        "washrooms_number": "3",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "18 Sommerset Way, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,480",
        "description": "Luxury Tridel Condo, Beautiful Corner Suite, (Newly Renovated - Painting). Mckee P.S. & Earl Haig S.S. District, Great Building W/All Facilities, Including Indoor Pool, Guest Suite, Security Guard, Exercise Room. Car Wash, Close To Subway Station And Shopping.",
        "bedrooms_number": "3",
        "washrooms_number": "2",
        "square_feet": "1199",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In Area",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "1285 Queen St E, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,499",
        "description": "Welcome to this spacious condo with a massive private balcony, nestled in a quiet residential pocket of the highly desirable Leslieville neighbourhood. This bright and stylish 2-bedroom +den, 2-bathroom suite boasts a well-designed open-concept layout with a contemporary kitchen featuring sleek cabinetry and integrated appliances, a generous living and dining area, and aversatile den, perfect for a home office or creative space.High-end finishes are found throughout, including wide-plank flooring, modern bathrooms, and abundant natural light. The expansive balcony offers an ideal setting for entertaining orrelaxing, with unobstructed, lush greenery views that provide a rare sense of peace and privacyin the city. The serene primary bedroom features a spa-like 4-piece ensuite and private accessto the balcony. The second bedroom is equally inviting, featuring a large window and double closet.Set just steps from Leslievilles top-rated restaurants, charming cafes, and scenic parks, this exceptional home offers the best of urban living in one of Torontos most vibrant and connected communities.",
        "bedrooms_number": "2+1",
        "washrooms_number": "2",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "1733 Queen St E, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,500",
        "description": "Welcome to this bright and spacious 2+1 bedroom, 2 full bath suite in the heart of the Beaches!Offering 950 sq ft of functional open-concept living with a desirable split-bedroom layout and open balcony, this home combines comfort and style.Enjoy brand new kitchen appliances, a convenient breakfast bar, and a generously sized primary bedroom featuring a walk-in closet and 4-piece ensuite. Comes with an extra-large storage locker for added convenience.Located in a quiet, pet friendly building within one of Toronto's most sought-after neighbourhoods. A true biker's paradise, and just a short walk to the beach, beautiful parks,trendy shops, cozy cafes, restaurants, a movie theatre, groceries, and 24-hour transit right at your doorstep.",
        "bedrooms_number": "2+1",
        "washrooms_number": "2",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "5180 Yonge St, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,500",
        "description": "Luxury Beacon Condo In The Heart Of North York. This 2 Bedroom, 2 Washroom Unit , Plus Large Parking Space is One of best Layout of this building With Floor To Ceiling Windows. Open Concept Kitchen with All Stainless Appliances/Quartz Counter. Premium Laminate Floor Throughout, Amazing Living Space With wide East/South Exposure View. Direct Access To Subway Station And Steps To Shopping, Restaurants, Schools, TTC And Much More plus one Large Parking and much more.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "799",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "10 Inn on the park Rd, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,500",
        "description": "BRAND NEW CHATEAU at AUBERGE ON THE PARK, THIS LUXURIOUS UNIT, COMES WITH TOP OF THE LINE FINISHINGS, LAMINATE FLOOR THROUGHOUT, UNOBSTRUCTED PANORAMIC NE VIEW, OVERLOOKING THE LESLIE PARK, 9 FOOT CEiLING, WRAP AROUND BALCONY. STEPS AWAY TO THE NEW Crosstown LRT(September/2025), DVP, SHOPPING, Costco, PARK, restaurants, and more. Tenant pay utilities: Hydro, Hot Water, Heat and CAC, Tenant insurance of 2M liability and $300 key deposit.",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "999",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "2 Anndale Dr, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,600",
        "description": "Luxury Corner Unit Hullmark Centre! Bright and spacious 2 Bed, 2 Bath furnished corner unit featuring brand new flooring throughout, spacious closets with built-in organizers, and unobstructed northwest views. Enjoy direct indoor access to Yonge & Sheppard subway lines, with Whole Foods just steps away and Highway 401 minutes from your door. Furnished unit includes: sofa, 2 chairs, ottoman, dining table with 4 chairs, coffee table, stand lamp, shelf, bed frame, wooden cabinet, 3 outdoor chairs with ottoman, and shoe rack located in prime North York. Top-tier amenities include: 24-hour concierge, gym, pool, sauna, party room, billiards, outdoor terrace with BBQ, yoga studio, guest suite, and theater room. Live in style and convenience in the heart of North York!",
        "bedrooms_number": "2",
        "washrooms_number": "2",
        "square_feet": "899",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "18 Parkview Ave, Toronto",
        "property_type": "Condo Apt Apartment",
        "price": "$3,900",
        "description": "Bright & Spacious South West Corner Unit With Fantastic View. Approx 1,131 Sq Ft Plus Large L-Shape Balcony. Separated Bedrooms, Solarium Can Be Used As 3rd Bedroom. Steps To Subway, Library, Schools, North York City Centre, Empress Walk, Shopping, Theatre, Restaurants. Totally Renovated, Moving In And Enjoy.",
        "bedrooms_number": "2+1",
        "washrooms_number": "2",
        "square_feet": "1199",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "Ensuite",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    },
    {
        "address": "75 The Donway W, Toronto",
        "property_type": "Condo Townhouse 3-Storey",
        "price": "$4,000",
        "description": "Welcome to This Modern Townhouse Prime Location at Shops at Don Mills! 75 The Donway West. Welcome to urban living at its finest! This stunning 3-bedroom, 3-bathroom townhouse is located in the heart of the Shops at Don Mills, one of Torontos most vibrant lifestyle destinations. Offering a perfect blend of style, space, and convenience, this residence is ideal for professionals, couples, or families looking for upscale city living. Sit in Your Living Room And Watch Your Kids Play In The Park In Front of Your Doors. Features Include: Spacious open-concept main floor with modern kitchen, stainless steel appliances, quartz countertops, powder room and a breakfast bar. Large windows offering plenty of natural light throughout. Private primary suite with spa-inspired ensuite and walk-in closet Generously sized second and third bedrooms. Private terrace perfect for summer evenings or morning coffee. Direct access parking and ample storage space. In-unit laundry for added convenience. Location Highlights: Steps to premium shops, restaurants, cafes, and entertainment. Easy access to public transit, DVP, and major routes. Minutes from parks, schools, and community amenities. Whether you're entertaining guests or enjoying a quiet evening at home this elegant townhouse offers everything you need in a premium Toronto neighbourhood.",
        "bedrooms_number": "2+1",
        "washrooms_number": "3",
        "square_feet": "1599",
        "parking_type": "Underground",
        "ac_type": "Central Air",
        "laundry_type": "In-Suite Laundry, Inside",
        "heating_type": "Gas",
        "sale_or_rent": "for lease"
    }
]